{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/4_log/01_data_merge_8Feb26_21.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Feb 2026, 21:44:05
{txt}r; t=0.00 21:44:05
{com}.         
. {c )-}       
{txt}r; t=0.00 21:44:05

{com}. *------------------------------------------------------------------------------*
. **#Load the dataset
. 
. 
. display "======================================================================"
{res}======================================================================
{txt}r; t=0.00 21:44:05

{com}. display "STEP 1: NON-FOOD NON-DURABLE AGGREGATE (S06A)"
{res}STEP 1: NON-FOOD NON-DURABLE AGGREGATE (S06A)
{txt}r; t=0.02 21:44:05

{com}. display "======================================================================"
{res}======================================================================
{txt}r; t=0.00 21:44:05

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 1: NON-FOOD NON-DURABLE (SECTION 6A) - STRICT EXCLUSIONS                *
. *------------------------------------------------------------------------------*
. 
. tempfile sec6a_agg
{txt}r; t=0.00 21:44:05

{com}. 
. preserve 
{txt}r; t=0.00 21:44:05

{com}.     use "$data_raw/S06A.dta", clear
{txt}(NLSS04_DICT)
r; t=0.40 21:44:05

{com}. 
.     *--------------------------------------------------------------------------*
.     * A. DEFINE EXCLUSIONS (Based on Methodology Text)
.     *--------------------------------------------------------------------------*
.         
.         gen is_header = mod(s06a_code, 10) == 0
{txt}r; t=0.15 21:44:05

{com}.     drop if is_header == 1
{txt}(345,600 observations deleted)
r; t=0.12 21:44:05

{com}.     
.     * 1. DURABLES (Investments/Assets)
.     * Furniture, Vehicles, Electronics, etc.
.     local durables 511 512 531 532 541 551 711 712 713 714 ///
>                    911 912 913 914 922 932 943 1231
{txt}r; t=0.00 21:44:05

{com}. 
.     * 2. HEALTH EXPENSES but included education as well from 0955 (Defensive Expenditure - Excluded per Methodology)
.     * 1051 = Preventive health care
.     * 1052 = Treatment care (medicines, admission)
.     local health_excluded 1051 1052
{txt}r; t=0.00 21:44:05

{com}. 
.     * 3. NON-CONSUMPTION & LUMPY EXPENDITURES
.     * 1241 = Donations (Transfer out)
.     * 1251 = Life Insurance (Savings/Investment)
.     * 1252 = Non-life Insurance (often excluded)
.     * 1262 = Banking fees (Often considered service, but can be financial cost. We KEEP this usually as a service fee, unless "Interest payments")
.     * 1271 = Registration/Renewal Fees (Taxes/Levies - Excluded)
.     * 1272 = Legal Expenses (Often lumpy/admin - Excluded)
.     * 1273 = Marriage/Death/Birth functions (Lumpy Life Events - Excluded)
.     local lumpy_excluded 1241 1251 1252 1271 1272 1273
{txt}r; t=0.00 21:44:05

{com}. 
.     * APPLY EXCLUSIONS
.     foreach code of local durables {c -(}
{txt}  2{com}.         drop if s06a_code == `code'
{txt}  3{com}.     {c )-}
{txt}(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
r; t=2.68 21:44:08

{com}.     foreach code of local health_excluded {c -(}
{txt}  2{com}.         drop if s06a_code == `code'
{txt}  3{com}.     {c )-}
{txt}(9,600 observations deleted)
(9,600 observations deleted)
r; t=0.45 21:44:08

{com}.     foreach code of local lumpy_excluded {c -(}
{txt}  2{com}.         drop if s06a_code == `code'
{txt}  3{com}.     {c )-}
{txt}(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
(9,600 observations deleted)
r; t=0.50 21:44:09

{com}. 
.     *--------------------------------------------------------------------------*
.     * B. IDENTIFY EDUCATION (To be compared with S07 later)
.     *--------------------------------------------------------------------------*
.     * 1010-1040 = School Fees
.     * 0955 = Academic Books
.     * 1122 = Hostel Costs
.     gen is_education_s06 = 0
{txt}r; t=0.05 21:44:09

{com}.     replace is_education_s06 = 1 if inlist(s06a_code, 1010, 1020, 1030, 1040, 0955, 1122)
{txt}(19,200 real changes made)
r; t=0.08 21:44:09

{com}. 
.     *--------------------------------------------------------------------------*
.     * C. CLEANING & AGGREGATION
.     *--------------------------------------------------------------------------*
.     
.     * Clean Missing Values
.     replace q06_02a_b = 0 if q06_02a_b == .  // 30-day recall
{txt}(445,872 real changes made)
r; t=0.16 21:44:09

{com}.     replace q06_02a_a = 0 if q06_02a_a == .  // 12-month recall
{txt}(445,872 real changes made)
r; t=0.11 21:44:09

{com}. 
.     * Calculate Annual Expenditure (Methodology 3.2.1)
.     gen annualized_30 = q06_02a_b * 12
{txt}r; t=0.13 21:44:09

{com}.     
.     * Calculate Medians
.     bysort s06a_code: egen median_30_ann = median(annualized_30) if annualized_30 > 0
{txt}(551,351 missing values generated)
r; t=1.57 21:44:11

{com}.     bysort s06a_code: egen median_12 = median(q06_02a_a) if q06_02a_a > 0
{txt}(445,872 missing values generated)
r; t=1.05 21:44:12

{com}.     
.     replace median_30_ann = 0 if median_30_ann == .
{txt}(551,351 real changes made)
r; t=0.11 21:44:12

{com}.     replace median_12 = 0 if median_12 == .
{txt}(445,872 real changes made)
r; t=0.08 21:44:12

{com}. 
.     * Check Regularity (Diff <= 20%)
.     gen pct_diff = abs(median_30_ann - median_12) / median_12 if median_12 > 0
{txt}(445,872 missing values generated)
r; t=0.09 21:44:12

{com}.     gen is_regular = 0
{txt}r; t=0.04 21:44:12

{com}.     replace is_regular = 1 if pct_diff <= 0.20 & pct_diff != .
{txt}(35,564 real changes made)
r; t=0.08 21:44:13

{com}. 
.     * Select Final Amount
.     gen final_item_exp = .
{txt}(633,600 missing values generated)
r; t=0.05 21:44:13

{com}.     replace final_item_exp = annualized_30 if is_regular == 1
{txt}(35,564 real changes made)
r; t=0.07 21:44:13

{com}.     replace final_item_exp = q06_02a_a if is_regular == 1 & final_item_exp == 0
{txt}(0 real changes made)
r; t=0.09 21:44:13

{com}.     replace final_item_exp = q06_02a_a if is_regular == 0
{txt}(598,036 real changes made)
r; t=0.10 21:44:13

{com}.     replace final_item_exp = annualized_30 if is_regular == 0 & final_item_exp == 0
{txt}(0 real changes made)
r; t=0.12 21:44:13

{com}. 
.     *--------------------------------------------------------------------------*
.     * D. COLLAPSE TO HOUSEHOLD LEVEL (Splitting Education vs Other)
.     *--------------------------------------------------------------------------*
.     
.     * Sum separately for Education and Non-Education
.     collapse (sum) educ_s06_total = final_item_exp ///
>                    nonfood_s06_other = final_item_exp, ///
>              by(psu_number hh_number is_education_s06)
{res}{txt}r; t=0.56 21:44:14

{com}.              
.     * Flatten to 1 row per HH
.     replace educ_s06_total = 0 if is_education_s06 == 0
{txt}(9,600 real changes made)
r; t=0.02 21:44:14

{com}.     replace nonfood_s06_other = 0 if is_education_s06 == 1
{txt}(4,514 real changes made)
r; t=0.00 21:44:14

{com}.     
.     collapse (sum) educ_s06_total nonfood_s06_other, by(psu_number hh_number)
{res}{txt}r; t=0.02 21:44:14

{com}. 
.     label var educ_s06_total "Education Exp (Section 6A)"
{txt}r; t=0.00 21:44:14

{com}.     label var nonfood_s06_other "Other Non-Food Exp (S06A) - Excl Health/Taxes"
{txt}r; t=0.00 21:44:14

{com}. 
.     save `sec6a_agg', replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000001.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000001.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.00 21:44:14

{com}. restore
{txt}r; t=0.00 21:44:14

{com}. display "Section 6A Finalized (Health & Lumpy Items Excluded)."
{res}Section 6A Finalized (Health & Lumpy Items Excluded).
{txt}r; t=0.00 21:44:14

{com}. 
. 
. 
. 
. 
. 
. 
. *------------------------------------------------------------------------------*
. * STEP 2: EDUCATION (SECTION 7)                                                *
. *------------------------------------------------------------------------------*
. tempfile educ_s07_agg
{txt}r; t=0.00 21:44:14

{com}. preserve
{txt}r; t=0.02 21:44:14

{com}.     use "$data_raw/S07.dta", clear
{txt}(NLSS04_DICT)
r; t=0.02 21:44:14

{com}.     foreach var of varlist q07_17_a-q07_17_g {c -(}
{txt}  2{com}.         replace `var' = 0 if `var' == .
{txt}  3{com}.     {c )-}
{txt}(35,878 real changes made)
(35,878 real changes made)
(35,878 real changes made)
(35,878 real changes made)
(35,878 real changes made)
(35,878 real changes made)
(35,878 real changes made)
r; t=0.05 21:44:14

{com}.     egen educ_individual_total = rowtotal(q07_17_a-q07_17_g)
{txt}r; t=0.07 21:44:14

{com}.     collapse (sum) educ_s07_total = educ_individual_total, by(psu_number hh_number)
{res}{txt}r; t=0.02 21:44:14

{com}.     save `educ_s07_agg', replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000003.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000003.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.00 21:44:14

{com}. restore
{txt}r; t=0.00 21:44:14

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 3: UTILITIES (SECTION 2)                                                *
. *------------------------------------------------------------------------------*
. tempfile util_agg
{txt}r; t=0.00 21:44:14

{com}. preserve
{txt}r; t=0.00 21:44:14

{com}.     use "$data_raw/S02.dta", clear
{txt}(NLSS04_DICT)
r; t=0.01 21:44:14

{com}.     
.     * Clean missing
.     replace q02_23 = 0 if q02_23 == .   // Water (Annual)
{txt}(1 real change made)
r; t=0.00 21:44:14

{com}.     replace q02_26 = 0 if q02_26 == .   // Garbage (Monthly)
{txt}(7,381 real changes made)
r; t=0.00 21:44:14

{com}.     replace q02_30 = 0 if q02_30 == .   // Electricity (Annual)
{txt}(0 real changes made)
r; t=0.00 21:44:14

{com}.     replace q02_31_a2 = 0 if q02_31_a2 == . // Landline (Annual)
{txt}(9,430 real changes made)
r; t=0.00 21:44:14

{com}. 
.     * Calculate Utilities (Annualize Garbage)
.     gen utilities_annual = q02_23 + (q02_26 * 12) + q02_30 + q02_31_a2
{txt}r; t=0.00 21:44:14

{com}.     
.     collapse (sum) utilities_annual, by(psu_number hh_number)
{res}{txt}r; t=0.01 21:44:14

{com}.     save `util_agg', replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000005.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000005.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.00 21:44:14

{com}. restore
{txt}r; t=0.00 21:44:14

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 4: FINAL MERGE                                                          *
. *------------------------------------------------------------------------------*
. use `sec6a_agg', clear
{txt}(NLSS04_DICT)
r; t=0.00 21:44:14

{com}. 
. * Merge S07 (Education)
. merge 1:1 psu_number hh_number using `educ_s07_agg'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.03 21:44:14

{com}. drop _merge
{txt}r; t=0.00 21:44:14

{com}. replace educ_s07_total = 0 if educ_s07_total == .
{txt}(0 real changes made)
r; t=0.00 21:44:14

{com}. 
. * Merge S02 (Utilities)
. merge 1:1 psu_number hh_number using `util_agg'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 21:44:14

{com}. drop _merge
{txt}r; t=0.00 21:44:14

{com}. replace utilities_annual = 0 if utilities_annual == .
{txt}(0 real changes made)
r; t=0.00 21:44:14

{com}. 
. * COMPUTE FINAL AGGREGATES
. * 1. Final Education = Max(Section 6A, Section 7)
. gen educ_final = max(educ_s06_total, educ_s07_total)
{txt}r; t=0.00 21:44:14

{com}. 
. * 2. Final Non-Food Non-Durable Aggregate
. * Note: Health is EXCLUDED. Taxes are EXCLUDED.
. gen agg_nonfood_nondurable = nonfood_s06_other + educ_final + utilities_annual
{txt}r; t=0.00 21:44:14

{com}. 
. label var agg_nonfood_nondurable "Final Non-Food Non-Durable Aggregate (Annual)"
{txt}r; t=0.00 21:44:14

{com}. 
. * Check
. summarize agg_nonfood_nondurable, detail

        {txt}Final Non-Food Non-Durable Aggregate (Annual)
{hline 61}
      Percentiles      Smallest
 1%    {res}     8540            350
{txt} 5%    {res}    17895            600
{txt}10%    {res}    25530           1010       {txt}Obs         {res}      9,600
{txt}25%    {res}    45900           1310       {txt}Sum of wgt. {res}      9,600

{txt}50%    {res}    82578                      {txt}Mean          {res} 118581.6
                        {txt}Largest       Std. dev.     {res}   125260
{txt}75%    {res}   145030        1578490
{txt}90%    {res} 246287.5        1664420       {txt}Variance      {res} 1.57e+10
{txt}95%    {res} 343092.5        1670900       {txt}Skewness      {res} 3.817358
{txt}99%    {res}   613000        1726600       {txt}Kurtosis      {res} 28.55472
{txt}r; t=0.01 21:44:14

{com}. 
. * Save
. save "$data_tmp/agg_nonfood_nondurable_final.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/1_data/4_tmp/agg_nonfood_nondurable_final.dta{rm}
saved
{p_end}
r; t=0.01 21:44:14

{com}. 
. 
. 
. 
. 
{txt}end of do-file
r; t=9.30 21:44:14

{com}. do "$prep/2_durables.do"
{txt}
{com}. *------------------------------------------------------------------------------*
. * STEP 3.2.2: DURABLES CONSUMPTION FLOW (USER COST) - EXCEL VERSION            *
. *------------------------------------------------------------------------------*
. 
. import excel "$data_raw/CPI_2022.xlsx", sheet("Sheet1") firstrow clear
{res}{text}(2 vars, 51 obs)
r; t=0.05 21:44:14

{com}. 
. 
. rename year purchase_year
{res}{txt}r; t=0.05 21:44:14

{com}. tostring purchase_year, replace
{txt}purchase_year already string; no {res}replace
{txt}r; t=0.03 21:44:14

{com}. 
. summarize cpi if purchase_year == "2022"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}cpi {c |}{res}          1         100           .        100        100
{txt}r; t=0.00 21:44:14

{com}. local cpi_2022 = r(mean)
{txt}r; t=0.00 21:44:14

{com}. gen cpi_factor = `cpi_2022' / cpi
{txt}r; t=0.00 21:44:14

{com}. 
. 
. tempfile cpi_data
{txt}r; t=0.00 21:44:14

{com}. save `cpi_data', replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000001.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000001.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.00 21:44:14

{com}. 
. 
. *------------------------------------------------------------------------------*
. * 2. LOAD & PROCESS DURABLES DATA (S06C)
. *------------------------------------------------------------------------------*
. use "$data_raw/S06C.dta", clear
{txt}(NLSS04_DICT)
r; t=0.10 21:44:14

{com}. 
. 
. * Exclude: 522 (Watch), 523 (Furniture), 524 (Utensils) and only the household owning them
. keep if s06c_code >= 501 & s06c_code <= 521
{txt}(38,400 observations deleted)
r; t=0.05 21:44:14

{com}. keep if q06_03c == 1
{txt}(167,260 observations deleted)
r; t=0.04 21:44:14

{com}. 
. replace q06_04 = 1 if q06_04 == . | q06_04 == 0
{txt}(1 real change made)
r; t=0.00 21:44:14

{com}. 
. replace q06_05a = 0 if q06_05a == . 
{txt}(0 real changes made)
r; t=0.00 21:44:14

{com}. gen purchase_year_num = 2022 - q06_05a
{txt}r; t=0.00 21:44:14

{com}. 
. tostring purchase_year_num, generate(purchase_year)
{txt}purchase_year generated as {res:str4}
r; t=0.11 21:44:14

{com}. replace purchase_year = trim(purchase_year)
{txt}(0 real changes made)
r; t=0.01 21:44:14

{com}. 
. 
. * Merge with CPI data
. merge m:1 purchase_year using `cpi_data'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              11
{txt}{col 9}from master{col 30}{res}               4{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          34,336{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.09 21:44:14

{com}. 
. /*
>   Result                      Number of obs
>     -----------------------------------------
>     Not matched                            11
>         from master                         4  (_merge==1)
>         from using                          7  (_merge==2)
> 
>     Matched                            34,336  (_merge==3)
>     -----------------------------------------
>         
>         Here 4 of the observations are not merged because there are items from 1957, 1959, 1962
> */
. 
. *------------------------------------------------------------------------------*
. * Post merge fix (ignore if needed)
. *------------------------------------------------------------------------------*
. 
.         drop if _merge == 2 
{txt}(7 observations deleted)
r; t=0.00 21:44:14

{com}. 
.         * Fix the 4 old items (1957, 1959, 1962) using 1972 data
.         * We grab the factor for 1972 from the successful matches
.         summarize cpi_factor if purchase_year == "1972"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}cpi_factor {c |}{res}          3    47.92805           0   47.92805   47.92805
{txt}r; t=0.00 21:44:14

{com}.         local factor_1972 = r(mean)
{txt}r; t=0.00 21:44:14

{com}. 
.         * Apply this factor to the unmatched items (where _merge == 1)
.         replace cpi_factor = `factor_1972' if _merge == 1 & cpi_factor == .
{txt}(4 real changes made)
r; t=0.00 21:44:14

{com}. 
.         drop _merge
{txt}r; t=0.00 21:44:14

{com}. 
. *------------------------------------------------------------------------------*
. * 2. CALCULATE REAL VALUE & DEPRECIATION
. *------------------------------------------------------------------------------*
. 
. gen real_purchase_value = q06_05b * cpi_factor
{txt}r; t=0.00 21:44:14

{com}. 
. * Calculate Depreciation (Delta)
. * Formula: delta = 1 - (Current_Value / Real_Purchase_Value) ^ (1/Age)
. * Use Age=1 for new items to avoid division by zero
. gen age_calc = max(q06_05a, 1)
{txt}r; t=0.00 21:44:14

{com}. gen ratio = q06_07 / real_purchase_value
{txt}(255 missing values generated)
r; t=0.00 21:44:14

{com}. gen delta_raw = 1 - (ratio)^(1/age_calc)
{txt}(255 missing values generated)
r; t=0.00 21:44:14

{com}. 
. * Clean outliers 
. * Delta cannot be > 1 (value dropped to zero instantly) or < 0 (value increased)
. replace delta_raw = . if delta_raw > 1 | delta_raw < 0
{txt}(5,563 real changes made, 5,563 to missing)
r; t=0.01 21:44:14

{com}. replace delta_raw = . if real_purchase_value <= 0
{txt}(0 real changes made)
r; t=0.01 21:44:14

{com}. 
. 
. * Define Age Groups (0-1, 2-3, 4-5, 6-10, 10+)
. *This is mentioned in the methodology and one of the advancement from previous years
. 
. gen age_group = .
{txt}(34,340 missing values generated)
r; t=0.00 21:44:14

{com}. replace age_group = 1 if q06_05a <= 1           
{txt}(9,751 real changes made)
r; t=0.01 21:44:14

{com}. replace age_group = 2 if q06_05a >= 2 & q06_05a <= 3
{txt}(10,517 real changes made)
r; t=0.02 21:44:14

{com}. replace age_group = 3 if q06_05a >= 4 & q06_05a <= 5
{txt}(6,038 real changes made)
r; t=0.00 21:44:14

{com}. replace age_group = 4 if q06_05a >= 6 & q06_05a <= 10
{txt}(5,942 real changes made)
r; t=0.00 21:44:14

{com}. replace age_group = 5 if q06_05a > 10
{txt}(2,092 real changes made)
r; t=0.00 21:44:14

{com}. 
. bysort s06c_code age_group: egen median_delta = median(delta_raw)
{txt}r; t=0.12 21:44:15

{com}. 
. * Fill missing medians with item's overall median, then global default (0.2)
. bysort s06c_code: egen global_item_median = median(delta_raw)
{txt}r; t=0.08 21:44:15

{com}. replace median_delta = global_item_median if median_delta == .
{txt}(0 real changes made)
r; t=0.00 21:44:15

{com}. replace median_delta = 0.20 if median_delta == .
{txt}(0 real changes made)
r; t=0.00 21:44:15

{com}. 
. 
. *------------------------------------------------------------------------------*
. * 4. CALCULATE USER COST (CONSUMPTION FLOW)
. *------------------------------------------------------------------------------*
. 
. * Formula: UserCost = (CurrentValue * Qty) * ( (r + delta) / (1 - delta) )
. **# Real Interest Rate = 0.05 (Update Later after looking the actual figures)
. scalar r_real = 0.05
{txt}r; t=0.00 21:44:15

{com}. 
. gen current_val_total = q06_07 * q06_04
{txt}r; t=0.00 21:44:15

{com}. gen user_cost_item = current_val_total * ( (r_real + median_delta) / (1 - median_delta) )
{txt}r; t=0.00 21:44:15

{com}. 
. * Handle missings
. replace user_cost_item = 0 if user_cost_item == .
{txt}(0 real changes made)
r; t=0.00 21:44:15

{com}. 
. *------------------------------------------------------------------------------*
. * 5. AGGREGATE TO HOUSEHOLD LEVEL
. *------------------------------------------------------------------------------*
. collapse (sum) durables_flow_annual = user_cost_item, by(psu_number hh_number)
{res}{txt}r; t=0.06 21:44:15

{com}. 
. label var durables_flow_annual "Annual Consumption Flow from Durables (User Cost)"
{txt}r; t=0.00 21:44:15

{com}. 
. * Check stats
. summarize durables_flow_annual, detail

      {txt}Annual Consumption Flow from Durables (User Cost)
{hline 61}
      Percentiles      Smallest
 1%    {res} 176.1539              0
{txt} 5%    {res} 556.4413              0
{txt}10%    {res} 1404.155              0       {txt}Obs         {res}      9,376
{txt}25%    {res} 5484.135              0       {txt}Sum of wgt. {res}      9,376

{txt}50%    {res} 18822.76                      {txt}Mean          {res} 64261.05
                        {txt}Largest       Std. dev.     {res} 187061.4
{txt}75%    {res} 57721.94        3533006
{txt}90%    {res} 142375.9        4296198       {txt}Variance      {res} 3.50e+10
{txt}95%    {res} 235812.8        4969413       {txt}Skewness      {res} 13.83434
{txt}99%    {res} 748435.2        6890870       {txt}Kurtosis      {res} 331.5277
{txt}r; t=0.01 21:44:15

{com}. 
. * Save
. save "$data_tmp/agg_durables_final.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/1_data/4_tmp/agg_durables_final.dta{rm}
saved
{p_end}
r; t=0.01 21:44:15

{com}. 
. display "SUCCESS: Durables Flow (Section 3.2.2) Complete."
{res}SUCCESS: Durables Flow (Section 3.2.2) Complete.
{txt}r; t=0.00 21:44:15

{com}. 
{txt}end of do-file
r; t=0.92 21:44:15

{com}. do "$prep/3_house-rent.do"
{txt}
{com}. *------------------------------------------------------------------------------*
. *           Cleaning for housing/ rent part of consumption in NLSS                                         *
. /*
> 
>         Author:                         Arpan and Kapil
>         Date created:           7th Feb 2026
>         Date updated:           8th Feb 2026
>         Last Updated by:        Arpan
> 
>         Notes:                          Doing Hedonic regression here
>                         
>         Dependencies:           Run 0_master before
> 
> */
. 
. *------------------------------------------------------------------------------*
. * STEP 3.2.3a: PREPARE DURABLES STOCK VALUE (FOR HOUSING REGRESSION)           *
. *------------------------------------------------------------------------------*
. *------------------------------------------------------------------------------*
. * STEP 3.2.3a: PREPARE DURABLES STOCK VALUE (FOR HOUSING REGRESSION)           *
. *------------------------------------------------------------------------------*
. use "$data_raw/S06C.dta", clear
{txt}(NLSS04_DICT)
r; t=0.05 21:44:15

{com}. 
. * Calculate Total Value (Price * Quantity)
. gen item_stock_value = q06_07 * q06_04
{txt}(201,550 missing values generated)
r; t=0.04 21:44:15

{com}. replace item_stock_value = 0 if item_stock_value == .
{txt}(201,550 real changes made)
r; t=0.05 21:44:15

{com}. 
. * Aggregate to Household Level
. collapse (sum) durables_stock_value = item_stock_value, by(psu_number hh_number)
{res}{txt}r; t=0.15 21:44:15

{com}. 
. * Handle Zeros before taking Log (add small constant 1)
. gen ln_durables_value = ln(durables_stock_value + 1)
{txt}r; t=0.00 21:44:15

{com}. 
. label var durables_stock_value "Total Current Value of All Durables"
{txt}r; t=0.00 21:44:15

{com}. label var ln_durables_value "Log of Total Durable Value"
{txt}r; t=0.00 21:44:15

{com}. 
. tempfile durables_stock
{txt}r; t=0.00 21:44:15

{com}. save `durables_stock'
{txt}{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000001.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.00 21:44:15

{com}. 
. 
. *------------------------------------------------------------------------------*
. * STEP 3.2.3b: PREPARE REGION & ACCESS VARIABLES                               *
. *------------------------------------------------------------------------------*
. 
. *--- 1. PREPARE REGION (STRATA) ---*
. use "$data_raw/poverty.dta", clear
{txt}(NLSS04_DICT)
r; t=0.00 21:44:15

{com}. keep psu_number hh_number ad_4
{txt}r; t=0.00 21:44:15

{com}. 
. *Create the dummies
. gen is_ktm   = (ad_4 == 1)
{txt}r; t=0.00 21:44:15

{com}. gen is_urban = (ad_4 == 2)
{txt}r; t=0.00 21:44:15

{com}. gen is_rural = (ad_4 == 3)
{txt}r; t=0.00 21:44:15

{com}. 
. tempfile region_data
{txt}r; t=0.00 21:44:15

{com}. save `region_data'
{txt}{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000002.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.00 21:44:15

{com}. 
. *--- 2. PREPARE ACCESS TO FACILITIES (SECTION 3) ---*
. use "$data_raw/S03.dta", clear
{txt}(NLSS04_DICT)
r; t=0.33 21:44:15

{com}. 
. 
. keep psu_number hh_number s03_code q03_03
{txt}r; t=0.01 21:44:15

{com}. duplicates drop psu_number hh_number s03_code, force

{p 0 4}{txt}Duplicates in terms of {res} psu_number hh_number s03_code{p_end}

{txt}(0 observations are duplicates)
r; t=1.22 21:44:17

{com}. 
. 
. reshape wide q03_03, i(psu_number hh_number) j(s03_code)
{txt}(j = 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}     220,800   {txt}->   {res}9,600       
{txt}Number of variables        {res}           4   {txt}->   {res}25          
{txt}j variable (23 values)         {res}s03_code   {txt}->   (dropped)
xij variables:
                                 {res}q03_03   {txt}->   {res}q03_03101 q03_03102 ... q03_03123
{txt}{hline 77}
r; t=2.65 21:44:19

{com}. 
. rename q03_03101 dist_child_center     // Early Childhood Dev Center
{res}{txt}r; t=0.01 21:44:19

{com}. rename q03_03102 dist_basic_school     // Basic School (1-8)
{res}{txt}r; t=0.00 21:44:19

{com}. rename q03_03103 dist_sec_school       // Secondary School (12)
{res}{txt}r; t=0.00 21:44:19

{com}. rename q03_03108 dist_gov_hospital     // Government Hospital
{res}{txt}r; t=0.00 21:44:19

{com}. rename q03_03118 dist_bank             // Bank / Financial Inst
{res}{txt}r; t=0.00 21:44:19

{com}. rename q03_03121 dist_police           // Police Station
{res}{txt}r; t=0.00 21:44:19

{com}. rename q03_03122 dist_ward             // Ward Office
{res}{txt}r; t=0.00 21:44:19

{com}. 
. rename q03_03115 dist_market                    // confused whether to use haatbazar (114) or main market center
{res}{txt}r; t=0.00 21:44:19

{com}. 
. tempfile access_data
{txt}r; t=0.00 21:44:19

{com}. save `access_data'
{txt}{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000003.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.01 21:44:19

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 3.2.3d: MERGE ALL AND REGRESS                                           *
. *------------------------------------------------------------------------------*
. use "$data_raw/S02.dta", clear
{txt}(NLSS04_DICT)
r; t=0.00 21:44:19

{com}. 
. * MERGE DURABLES
. merge 1:1 psu_number hh_number using `durables_stock'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 21:44:19

{com}. keep if _merge == 3 // Keep matches
{txt}(0 observations deleted)
r; t=0.00 21:44:19

{com}. drop _merge
{txt}r; t=0.00 21:44:19

{com}. 
. * 2. MERGE REGION
. merge 1:1 psu_number hh_number using `region_data'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.05 21:44:19

{com}. keep if _merge == 3
{txt}(0 observations deleted)
r; t=0.00 21:44:19

{com}. drop _merge
{txt}r; t=0.00 21:44:19

{com}. 
. * 3. MERGE ACCESS TO FACILITIES
. merge 1:1 psu_number hh_number using `access_data'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 21:44:19

{com}. drop if _merge == 2
{txt}(0 observations deleted)
r; t=0.00 21:44:19

{com}. drop _merge
{txt}r; t=0.00 21:44:19

{com}. 
. 
. * --- DEFINE REGRESSION VARIABLES (MATCHING TABLE 3) ---
. 
. * Dependent Variable: Log Monthly Rent
. * Use Actual Rent (q02_18) or Self-Reported (q02_13)
. gen rent_monthly = .
{txt}(9,600 missing values generated)
r; t=0.00 21:44:19

{com}. replace rent_monthly = q02_18 if q02_18 > 0 & q02_18 < . 
{txt}(1,162 real changes made)
r; t=0.00 21:44:19

{com}. replace rent_monthly = q02_13 if rent_monthly == . & q02_13 > 0
{txt}(8,116 real changes made)
r; t=0.00 21:44:19

{com}. 
. * Log and Outlier Removal (> 2 SD)
. gen ln_rent_raw = ln(rent_monthly)
{txt}(322 missing values generated)
r; t=0.00 21:44:19

{com}. summarize ln_rent_raw

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}ln_rent_raw {c |}{res}      9,278    7.974387    1.149987   5.298317   11.69525
{txt}r; t=0.00 21:44:19

{com}. gen z_score = (ln_rent_raw - r(mean)) / r(sd)
{txt}(322 missing values generated)
r; t=0.00 21:44:19

{com}. replace ln_rent_raw = . if abs(z_score) > 2
{txt}(492 real changes made, 492 to missing)
r; t=0.00 21:44:19

{com}. 
. * Housing Characteristics
. gen ln_area = ln(q02_09)
{txt}r; t=0.00 21:44:19

{com}. gen num_rooms = q02_02_a
{txt}r; t=0.00 21:44:19

{com}. 
. *Amenities
. gen has_kitchen = (q02_02_b > 0 & q02_02_b != .)
{txt}r; t=0.00 21:44:19

{com}. 
. gen has_cement_wall = (q02_04 == 2)
{txt}r; t=0.00 21:44:19

{com}. gen has_cement_foundation = (q02_05 == 2 | q02_05 == 3) //2 = Cement Bonded and 3 = Pillar bonded
{txt}r; t=0.00 21:44:19

{com}. gen has_strong_roof = (q02_06 == 1 | q02_06 == 2)               //1= Galvanized Iron and 2 = Concrete Cement
{txt}r; t=0.00 21:44:19

{com}. 
. * Utilities
. gen has_piped_water      = (q02_21 == 1)
{txt}r; t=0.00 21:44:19

{com}. gen has_garbage_disposal = (q02_25 == 1 | q02_25 == 2) // Municipal or Private
{txt}r; t=0.00 21:44:19

{com}. gen has_sewage           = (q02_24 == 1)
{txt}r; t=0.00 21:44:19

{com}. gen has_electricity      = (q02_29 == 1)
{txt}r; t=0.00 21:44:19

{com}. gen has_landline         = (q02_31_a1 == 1)
{txt}r; t=0.00 21:44:19

{com}. gen has_internet         = (q02_31_c1 == 1)
{txt}r; t=0.01 21:44:19

{com}. 
. * Renter Status & Interactions
. gen is_renter = (q02_18 > 0 & q02_18 != .)
{txt}r; t=0.00 21:44:19

{com}. gen renter_ktm = (is_renter == 1 & is_ktm == 1)
{txt}r; t=0.02 21:44:19

{com}. gen renter_urban = (is_renter == 1 & is_urban == 1)
{txt}r; t=0.00 21:44:19

{com}. gen renter_rural = (is_renter == 1 & is_rural == 1)
{txt}r; t=0.00 21:44:19

{com}. 
. 
. 
. 
. * --- RUN HEDONIC REGRESSION ---
. * Putting psu level fixed effect as well...
. 
. regress ln_rent_raw ln_area num_rooms has_kitchen has_cement_wall ///
>         has_cement_foundation has_strong_roof has_piped_water ///
>         has_garbage_disposal has_sewage has_electricity has_landline has_internet ///
>         ln_durables_value renter_ktm renter_urban renter_rural ///
>         dist_child_center dist_basic_school dist_sec_school ///
>         dist_gov_hospital dist_bank dist_market dist_police dist_ward ///
>         i.psu_number

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     3,648
{txt}{hline 13}{c +}{hline 34}   F(614, 3033)    = {res}     9.63
{txt}       Model {c |} {res} 1971.48651       614  3.21089008   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1011.57017     3,033  .333521323   {txt}R-squared       ={res}    0.6609
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5922
{txt}       Total {c |} {res} 2983.05668     3,647  .817948089   {txt}Root MSE        =   {res} .57751

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} ln_rent_raw{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ln_area {c |}{col 14}{res}{space 2} .3351723{col 26}{space 2} .0345603{col 37}{space 1}    9.70{col 46}{space 3}0.000{col 54}{space 4} .2674083{col 67}{space 3} .4029363
{txt}{space 3}num_rooms {c |}{col 14}{res}{space 2} .1010444{col 26}{space 2} .0103648{col 37}{space 1}    9.75{col 46}{space 3}0.000{col 54}{space 4} .0807217{col 67}{space 3} .1213671
{txt}{space 1}has_kitchen {c |}{col 14}{res}{space 2}-.0068208{col 26}{space 2} .0314204{col 37}{space 1}   -0.22{col 46}{space 3}0.828{col 54}{space 4}-.0684282{col 67}{space 3} .0547865
{txt}has_cement~l {c |}{col 14}{res}{space 2}   .19338{col 26}{space 2} .0502998{col 37}{space 1}    3.84{col 46}{space 3}0.000{col 54}{space 4}  .094755{col 67}{space 3} .2920051
{txt}has_cement~n {c |}{col 14}{res}{space 2} .2343623{col 26}{space 2} .0508248{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4} .1347078{col 67}{space 3} .3340168
{txt}has_strong~f {c |}{col 14}{res}{space 2} .1244994{col 26}{space 2} .0320597{col 37}{space 1}    3.88{col 46}{space 3}0.000{col 54}{space 4} .0616384{col 67}{space 3} .1873604
{txt}has_piped_~r {c |}{col 14}{res}{space 2} .1124305{col 26}{space 2}  .031654{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} .0503649{col 67}{space 3}  .174496
{txt}has_garbag~l {c |}{col 14}{res}{space 2} .2105515{col 26}{space 2} .0779276{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0577552{col 67}{space 3} .3633478
{txt}{space 2}has_sewage {c |}{col 14}{res}{space 2}-.0854816{col 26}{space 2} .0856839{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4} -.253486{col 67}{space 3} .0825228
{txt}has_electr~y {c |}{col 14}{res}{space 2}  .040864{col 26}{space 2}  .041578{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-.0406599{col 67}{space 3}  .122388
{txt}has_landline {c |}{col 14}{res}{space 2}-.1903775{col 26}{space 2}  .317734{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-.8133734{col 67}{space 3} .4326183
{txt}has_internet {c |}{col 14}{res}{space 2} .1529414{col 26}{space 2} .0334831{col 37}{space 1}    4.57{col 46}{space 3}0.000{col 54}{space 4} .0872895{col 67}{space 3} .2185932
{txt}ln_durable~e {c |}{col 14}{res}{space 2} .0186719{col 26}{space 2} .0055868{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .0077176{col 67}{space 3} .0296262
{txt}{space 2}renter_ktm {c |}{col 14}{res}{space 2} -.308887{col 26}{space 2} .2508496{col 37}{space 1}   -1.23{col 46}{space 3}0.218{col 54}{space 4}-.8007395{col 67}{space 3} .1829656
{txt}renter_urban {c |}{col 14}{res}{space 2}-.1232678{col 26}{space 2} .0845892{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-.2891257{col 67}{space 3} .0425901
{txt}renter_rural {c |}{col 14}{res}{space 2} .3282999{col 26}{space 2} .1118935{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .1089051{col 67}{space 3} .5476948
{txt}dist_child~r {c |}{col 14}{res}{space 2}  .031644{col 26}{space 2} .0126385{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0068632{col 67}{space 3} .0564248
{txt}dist_basic~l {c |}{col 14}{res}{space 2}-.0491616{col 26}{space 2} .0111868{col 37}{space 1}   -4.39{col 46}{space 3}0.000{col 54}{space 4} -.071096{col 67}{space 3}-.0272272
{txt}dist_sec_s~l {c |}{col 14}{res}{space 2}-.0011777{col 26}{space 2} .0047555{col 37}{space 1}   -0.25{col 46}{space 3}0.804{col 54}{space 4}-.0105021{col 67}{space 3} .0081467
{txt}dist_gov_h~l {c |}{col 14}{res}{space 2} .0042614{col 26}{space 2} .0022982{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.0002448{col 67}{space 3} .0087675
{txt}{space 3}dist_bank {c |}{col 14}{res}{space 2}-.0048079{col 26}{space 2} .0033113{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-.0113004{col 67}{space 3} .0016846
{txt}{space 1}dist_market {c |}{col 14}{res}{space 2}-.0038055{col 26}{space 2} .0027062{col 37}{space 1}   -1.41{col 46}{space 3}0.160{col 54}{space 4}-.0091116{col 67}{space 3} .0015006
{txt}{space 1}dist_police {c |}{col 14}{res}{space 2} .0025224{col 26}{space 2} .0049909{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4}-.0072635{col 67}{space 3} .0123084
{txt}{space 3}dist_ward {c |}{col 14}{res}{space 2}  .005784{col 26}{space 2} .0069865{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 54}{space 4}-.0079147{col 67}{space 3} .0194827
{txt}{space 12} {c |}
{space 2}psu_number {c |}
{space 7}4002  {c |}{col 14}{res}{space 2}-.2295805{col 26}{space 2} .3639483{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.9431909{col 67}{space 3} .4840299
{txt}{space 7}4003  {c |}{col 14}{res}{space 2} .4210641{col 26}{space 2} .3410025{col 37}{space 1}    1.23{col 46}{space 3}0.217{col 54}{space 4}-.2475554{col 67}{space 3} 1.089684
{txt}{space 7}4004  {c |}{col 14}{res}{space 2}-.3543747{col 26}{space 2}  .382265{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-1.103899{col 67}{space 3} .3951499
{txt}{space 7}4005  {c |}{col 14}{res}{space 2}-.2804031{col 26}{space 2} .4140503{col 37}{space 1}   -0.68{col 46}{space 3}0.498{col 54}{space 4}-1.092251{col 67}{space 3} .5314445
{txt}{space 7}4006  {c |}{col 14}{res}{space 2} .7824692{col 26}{space 2} .3441702{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .1076388{col 67}{space 3}   1.4573
{txt}{space 7}4007  {c |}{col 14}{res}{space 2}-.2634746{col 26}{space 2} .3652151{col 37}{space 1}   -0.72{col 46}{space 3}0.471{col 54}{space 4}-.9795689{col 67}{space 3} .4526197
{txt}{space 7}4008  {c |}{col 14}{res}{space 2}  1.06259{col 26}{space 2} .5101431{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0623289{col 67}{space 3} 2.062851
{txt}{space 7}4009  {c |}{col 14}{res}{space 2} -.645537{col 26}{space 2} .5048646{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-1.635448{col 67}{space 3} .3443746
{txt}{space 7}4011  {c |}{col 14}{res}{space 2}-.2107753{col 26}{space 2} .3507022{col 37}{space 1}   -0.60{col 46}{space 3}0.548{col 54}{space 4}-.8984135{col 67}{space 3} .4768628
{txt}{space 7}4012  {c |}{col 14}{res}{space 2}-.1130955{col 26}{space 2} .3522877{col 37}{space 1}   -0.32{col 46}{space 3}0.748{col 54}{space 4}-.8038424{col 67}{space 3} .5776514
{txt}{space 7}4013  {c |}{col 14}{res}{space 2} .0549939{col 26}{space 2} .3465646{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-.6245314{col 67}{space 3} .7345191
{txt}{space 7}4014  {c |}{col 14}{res}{space 2} .3185027{col 26}{space 2} .3531748{col 37}{space 1}    0.90{col 46}{space 3}0.367{col 54}{space 4}-.3739836{col 67}{space 3} 1.010989
{txt}{space 7}4015  {c |}{col 14}{res}{space 2} .4307161{col 26}{space 2} .3654811{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.2858996{col 67}{space 3} 1.147332
{txt}{space 7}4016  {c |}{col 14}{res}{space 2}-.1359228{col 26}{space 2} .3413745{col 37}{space 1}   -0.40{col 46}{space 3}0.691{col 54}{space 4}-.8052717{col 67}{space 3} .5334262
{txt}{space 7}4017  {c |}{col 14}{res}{space 2} .0290424{col 26}{space 2} .4441002{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-.8417255{col 67}{space 3} .8998102
{txt}{space 7}4018  {c |}{col 14}{res}{space 2} 1.033421{col 26}{space 2} .3517284{col 37}{space 1}    2.94{col 46}{space 3}0.003{col 54}{space 4} .3437704{col 67}{space 3} 1.723071
{txt}{space 7}4019  {c |}{col 14}{res}{space 2} .6450776{col 26}{space 2} .3510692{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0432801{col 67}{space 3} 1.333435
{txt}{space 7}4020  {c |}{col 14}{res}{space 2} .3318056{col 26}{space 2} .4440251{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4} -.538815{col 67}{space 3} 1.202426
{txt}{space 7}4021  {c |}{col 14}{res}{space 2} .1231472{col 26}{space 2} .4115798{col 37}{space 1}    0.30{col 46}{space 3}0.765{col 54}{space 4}-.6838563{col 67}{space 3} .9301508
{txt}{space 7}4022  {c |}{col 14}{res}{space 2} 1.132213{col 26}{space 2} .6464105{col 37}{space 1}    1.75{col 46}{space 3}0.080{col 54}{space 4}-.1352337{col 67}{space 3} 2.399661
{txt}{space 7}4024  {c |}{col 14}{res}{space 2}-.0821205{col 26}{space 2} .3346457{col 37}{space 1}   -0.25{col 46}{space 3}0.806{col 54}{space 4}-.7382759{col 67}{space 3} .5740349
{txt}{space 7}4025  {c |}{col 14}{res}{space 2} .4637039{col 26}{space 2} .3400729{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.2030928{col 67}{space 3} 1.130501
{txt}{space 7}4026  {c |}{col 14}{res}{space 2} .3940863{col 26}{space 2}  .346065{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.2844595{col 67}{space 3} 1.072632
{txt}{space 7}4027  {c |}{col 14}{res}{space 2} .8631567{col 26}{space 2} .3559741{col 37}{space 1}    2.42{col 46}{space 3}0.015{col 54}{space 4} .1651818{col 67}{space 3} 1.561132
{txt}{space 7}4028  {c |}{col 14}{res}{space 2}-.5631457{col 26}{space 2} .5020021{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-1.547445{col 67}{space 3}  .421153
{txt}{space 7}4029  {c |}{col 14}{res}{space 2} .6316291{col 26}{space 2} .4108282{col 37}{space 1}    1.54{col 46}{space 3}0.124{col 54}{space 4}-.1739007{col 67}{space 3} 1.437159
{txt}{space 7}4030  {c |}{col 14}{res}{space 2}  .353753{col 26}{space 2}  .364924{col 37}{space 1}    0.97{col 46}{space 3}0.332{col 54}{space 4}-.3617705{col 67}{space 3} 1.069276
{txt}{space 7}4031  {c |}{col 14}{res}{space 2}-.0386656{col 26}{space 2} .3887558{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4} -.800917{col 67}{space 3} .7235859
{txt}{space 7}4032  {c |}{col 14}{res}{space 2} .1530491{col 26}{space 2}  .349128{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 54}{space 4}-.5315024{col 67}{space 3} .8376006
{txt}{space 7}4033  {c |}{col 14}{res}{space 2} .6109097{col 26}{space 2} .3645666{col 37}{space 1}    1.68{col 46}{space 3}0.094{col 54}{space 4}-.1039129{col 67}{space 3} 1.325732
{txt}{space 7}4034  {c |}{col 14}{res}{space 2} .5035364{col 26}{space 2} .3751198{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4}-.2319785{col 67}{space 3} 1.239051
{txt}{space 7}4035  {c |}{col 14}{res}{space 2} .0713278{col 26}{space 2} .3450661{col 37}{space 1}    0.21{col 46}{space 3}0.836{col 54}{space 4}-.6052593{col 67}{space 3} .7479148
{txt}{space 7}4036  {c |}{col 14}{res}{space 2} .2349484{col 26}{space 2} .3495432{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-.4504172{col 67}{space 3}  .920314
{txt}{space 7}4037  {c |}{col 14}{res}{space 2} .2151012{col 26}{space 2} .3392831{col 37}{space 1}    0.63{col 46}{space 3}0.526{col 54}{space 4}-.4501469{col 67}{space 3} .8803492
{txt}{space 7}4038  {c |}{col 14}{res}{space 2}  -.01982{col 26}{space 2} .4139126{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.8313977{col 67}{space 3} .7917576
{txt}{space 7}4039  {c |}{col 14}{res}{space 2} .7679069{col 26}{space 2} .5033549{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-.2190444{col 67}{space 3} 1.754858
{txt}{space 7}4040  {c |}{col 14}{res}{space 2} .4840014{col 26}{space 2} .5026312{col 37}{space 1}    0.96{col 46}{space 3}0.336{col 54}{space 4} -.501531{col 67}{space 3} 1.469534
{txt}{space 7}4041  {c |}{col 14}{res}{space 2} .7227077{col 26}{space 2} .5046791{col 37}{space 1}    1.43{col 46}{space 3}0.152{col 54}{space 4}-.2668401{col 67}{space 3} 1.712255
{txt}{space 7}4042  {c |}{col 14}{res}{space 2} 1.030517{col 26}{space 2} .6614884{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.2664942{col 67}{space 3} 2.327528
{txt}{space 7}4044  {c |}{col 14}{res}{space 2} 1.144285{col 26}{space 2} .5034297{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .1571867{col 67}{space 3} 2.131383
{txt}{space 7}4046  {c |}{col 14}{res}{space 2} .3613718{col 26}{space 2} .3550967{col 37}{space 1}    1.02{col 46}{space 3}0.309{col 54}{space 4}-.3348829{col 67}{space 3} 1.057626
{txt}{space 7}4047  {c |}{col 14}{res}{space 2} .3192181{col 26}{space 2} .4096904{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-.4840809{col 67}{space 3} 1.122517
{txt}{space 7}4048  {c |}{col 14}{res}{space 2} .8593108{col 26}{space 2} .6517308{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.4185681{col 67}{space 3}  2.13719
{txt}{space 7}4049  {c |}{col 14}{res}{space 2} 1.349161{col 26}{space 2} .4176426{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .5302701{col 67}{space 3} 2.168052
{txt}{space 7}4051  {c |}{col 14}{res}{space 2} .2040087{col 26}{space 2} .3585433{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4}-.4990038{col 67}{space 3} .9070213
{txt}{space 7}4052  {c |}{col 14}{res}{space 2} .2755647{col 26}{space 2} .3491466{col 37}{space 1}    0.79{col 46}{space 3}0.430{col 54}{space 4}-.4090233{col 67}{space 3} .9601526
{txt}{space 7}4053  {c |}{col 14}{res}{space 2} .8667111{col 26}{space 2} .4195113{col 37}{space 1}    2.07{col 46}{space 3}0.039{col 54}{space 4} .0441558{col 67}{space 3} 1.689266
{txt}{space 7}4054  {c |}{col 14}{res}{space 2} 1.094919{col 26}{space 2} .4440924{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .2241661{col 67}{space 3} 1.965671
{txt}{space 7}4055  {c |}{col 14}{res}{space 2} 1.014636{col 26}{space 2} .3557116{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .3171756{col 67}{space 3} 1.712096
{txt}{space 7}4056  {c |}{col 14}{res}{space 2} .0173448{col 26}{space 2} .4437542{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-.8527447{col 67}{space 3} .8874342
{txt}{space 7}4057  {c |}{col 14}{res}{space 2} .5588402{col 26}{space 2}   .34295{col 37}{space 1}    1.63{col 46}{space 3}0.103{col 54}{space 4}-.1135978{col 67}{space 3} 1.231278
{txt}{space 7}4058  {c |}{col 14}{res}{space 2}-.0917671{col 26}{space 2} .6528735{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-1.371887{col 67}{space 3} 1.188352
{txt}{space 7}4060  {c |}{col 14}{res}{space 2} .0126735{col 26}{space 2}  .372546{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4}-.7177947{col 67}{space 3} .7431418
{txt}{space 7}4062  {c |}{col 14}{res}{space 2} .4602239{col 26}{space 2} .5090106{col 37}{space 1}    0.90{col 46}{space 3}0.366{col 54}{space 4}-.5378169{col 67}{space 3} 1.458265
{txt}{space 7}4063  {c |}{col 14}{res}{space 2} 1.182062{col 26}{space 2} .3894865{col 37}{space 1}    3.03{col 46}{space 3}0.002{col 54}{space 4} .4183778{col 67}{space 3} 1.945746
{txt}{space 7}4064  {c |}{col 14}{res}{space 2} .3013886{col 26}{space 2} .3943541{col 37}{space 1}    0.76{col 46}{space 3}0.445{col 54}{space 4}-.4718398{col 67}{space 3} 1.074617
{txt}{space 7}4065  {c |}{col 14}{res}{space 2}-.9518661{col 26}{space 2} .6689835{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-2.263573{col 67}{space 3}  .359841
{txt}{space 7}4066  {c |}{col 14}{res}{space 2}-.4519561{col 26}{space 2} .3574069{col 37}{space 1}   -1.26{col 46}{space 3}0.206{col 54}{space 4} -1.15274{col 67}{space 3} .2488282
{txt}{space 7}4067  {c |}{col 14}{res}{space 2}-.3125288{col 26}{space 2}  .372261{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-1.042438{col 67}{space 3} .4173807
{txt}{space 7}4068  {c |}{col 14}{res}{space 2}-.2919981{col 26}{space 2}  .349371{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4} -.977026{col 67}{space 3} .3930297
{txt}{space 7}4069  {c |}{col 14}{res}{space 2} 1.784865{col 26}{space 2} .3959937{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4} 1.008422{col 67}{space 3} 2.561308
{txt}{space 7}4070  {c |}{col 14}{res}{space 2} .0212263{col 26}{space 2} .3962731{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-.7557649{col 67}{space 3} .7982174
{txt}{space 7}4071  {c |}{col 14}{res}{space 2}-.3713571{col 26}{space 2} .3602644{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-1.077744{col 67}{space 3}   .33503
{txt}{space 7}4072  {c |}{col 14}{res}{space 2}-.1835436{col 26}{space 2} .3567484{col 37}{space 1}   -0.51{col 46}{space 3}0.607{col 54}{space 4}-.8830368{col 67}{space 3} .5159497
{txt}{space 7}4073  {c |}{col 14}{res}{space 2}-.2581981{col 26}{space 2} .4244382{col 37}{space 1}   -0.61{col 46}{space 3}0.543{col 54}{space 4}-1.090414{col 67}{space 3} .5740176
{txt}{space 7}4074  {c |}{col 14}{res}{space 2} .2355852{col 26}{space 2} .3700853{col 37}{space 1}    0.64{col 46}{space 3}0.524{col 54}{space 4}-.4900581{col 67}{space 3} .9612286
{txt}{space 7}4075  {c |}{col 14}{res}{space 2} .0606929{col 26}{space 2} .3759207{col 37}{space 1}    0.16{col 46}{space 3}0.872{col 54}{space 4}-.6763922{col 67}{space 3}  .797778
{txt}{space 7}4076  {c |}{col 14}{res}{space 2} .5580727{col 26}{space 2} .4230321{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.2713861{col 67}{space 3} 1.387531
{txt}{space 7}4077  {c |}{col 14}{res}{space 2}-.6339811{col 26}{space 2} .4031458{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-1.424448{col 67}{space 3} .1564857
{txt}{space 7}4078  {c |}{col 14}{res}{space 2} .1150119{col 26}{space 2} .4072221{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4}-.6834473{col 67}{space 3} .9134711
{txt}{space 7}4079  {c |}{col 14}{res}{space 2}-.3156838{col 26}{space 2} .3437661{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.9897219{col 67}{space 3} .3583543
{txt}{space 7}4080  {c |}{col 14}{res}{space 2}-.0027962{col 26}{space 2}  .358564{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-.7058493{col 67}{space 3} .7002568
{txt}{space 7}4081  {c |}{col 14}{res}{space 2}-.8245304{col 26}{space 2} .3545007{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-1.519616{col 67}{space 3}-.1294444
{txt}{space 7}4082  {c |}{col 14}{res}{space 2} .5409406{col 26}{space 2} .3969396{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.2373573{col 67}{space 3} 1.319238
{txt}{space 7}4083  {c |}{col 14}{res}{space 2}-.0598835{col 26}{space 2} .3566138{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4}-.7591128{col 67}{space 3} .6393458
{txt}{space 7}4084  {c |}{col 14}{res}{space 2} .1425409{col 26}{space 2} .4104178{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 54}{space 4}-.6621845{col 67}{space 3} .9472662
{txt}{space 7}4085  {c |}{col 14}{res}{space 2}-.5666373{col 26}{space 2} .3579618{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4} -1.26851{col 67}{space 3}  .135235
{txt}{space 7}4086  {c |}{col 14}{res}{space 2}-.3339836{col 26}{space 2} .3626977{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-1.045142{col 67}{space 3} .3771747
{txt}{space 7}4087  {c |}{col 14}{res}{space 2}-.2387278{col 26}{space 2} .3421125{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4}-.9095237{col 67}{space 3} .4320682
{txt}{space 7}4088  {c |}{col 14}{res}{space 2} .2358391{col 26}{space 2} .3442371{col 37}{space 1}    0.69{col 46}{space 3}0.493{col 54}{space 4}-.4391227{col 67}{space 3} .9108008
{txt}{space 7}4089  {c |}{col 14}{res}{space 2}-.0929623{col 26}{space 2} .3530503{col 37}{space 1}   -0.26{col 46}{space 3}0.792{col 54}{space 4}-.7852043{col 67}{space 3} .5992798
{txt}{space 7}4090  {c |}{col 14}{res}{space 2}-.5684225{col 26}{space 2}  .371227{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4}-1.296305{col 67}{space 3} .1594594
{txt}{space 7}4091  {c |}{col 14}{res}{space 2} .1868725{col 26}{space 2} .4132441{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.6233944{col 67}{space 3} .9971394
{txt}{space 7}4092  {c |}{col 14}{res}{space 2} .0927147{col 26}{space 2} .3633242{col 37}{space 1}    0.26{col 46}{space 3}0.799{col 54}{space 4} -.619672{col 67}{space 3} .8051014
{txt}{space 7}4093  {c |}{col 14}{res}{space 2} .1597779{col 26}{space 2} .3509006{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-.5282493{col 67}{space 3}  .847805
{txt}{space 7}4094  {c |}{col 14}{res}{space 2} .2655702{col 26}{space 2} .3746665{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-.4690557{col 67}{space 3} 1.000196
{txt}{space 7}4095  {c |}{col 14}{res}{space 2} .1799522{col 26}{space 2} .6591416{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-1.112457{col 67}{space 3} 1.472362
{txt}{space 7}4096  {c |}{col 14}{res}{space 2} .2240203{col 26}{space 2} .4423391{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4}-.6432946{col 67}{space 3} 1.091335
{txt}{space 7}4097  {c |}{col 14}{res}{space 2}-.9419364{col 26}{space 2} .6513172{col 37}{space 1}   -1.45{col 46}{space 3}0.148{col 54}{space 4}-2.219004{col 67}{space 3} .3351314
{txt}{space 7}4098  {c |}{col 14}{res}{space 2}-.1226326{col 26}{space 2}  .344648{col 37}{space 1}   -0.36{col 46}{space 3}0.722{col 54}{space 4}-.7983999{col 67}{space 3} .5531347
{txt}{space 7}4099  {c |}{col 14}{res}{space 2} -.261806{col 26}{space 2} .3758665{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.9987848{col 67}{space 3} .4751728
{txt}{space 7}4100  {c |}{col 14}{res}{space 2}-.1489807{col 26}{space 2} .4459265{col 37}{space 1}   -0.33{col 46}{space 3}0.738{col 54}{space 4}-1.023329{col 67}{space 3} .7253681
{txt}{space 7}4101  {c |}{col 14}{res}{space 2}-.0395614{col 26}{space 2} .3579392{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}-.7413893{col 67}{space 3} .6622666
{txt}{space 7}4102  {c |}{col 14}{res}{space 2}  .176362{col 26}{space 2} .3688619{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4}-.5468826{col 67}{space 3} .8996066
{txt}{space 7}4103  {c |}{col 14}{res}{space 2} .6962246{col 26}{space 2} .3907558{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.0699484{col 67}{space 3} 1.462398
{txt}{space 7}4104  {c |}{col 14}{res}{space 2} .1251889{col 26}{space 2} .5030185{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}-.8611029{col 67}{space 3} 1.111481
{txt}{space 7}4105  {c |}{col 14}{res}{space 2}-.0425849{col 26}{space 2} .4108368{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-.8481317{col 67}{space 3} .7629619
{txt}{space 7}4106  {c |}{col 14}{res}{space 2} .4398993{col 26}{space 2} .3503682{col 37}{space 1}    1.26{col 46}{space 3}0.209{col 54}{space 4} -.247084{col 67}{space 3} 1.126882
{txt}{space 7}4107  {c |}{col 14}{res}{space 2} .4810153{col 26}{space 2} .3754025{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.2550538{col 67}{space 3} 1.217084
{txt}{space 7}4108  {c |}{col 14}{res}{space 2} .1427442{col 26}{space 2}  .351292{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.5460503{col 67}{space 3} .8315388
{txt}{space 7}4109  {c |}{col 14}{res}{space 2}-.0864903{col 26}{space 2} .3655936{col 37}{space 1}   -0.24{col 46}{space 3}0.813{col 54}{space 4}-.8033267{col 67}{space 3} .6303461
{txt}{space 7}4110  {c |}{col 14}{res}{space 2}-.0843037{col 26}{space 2} .3592905{col 37}{space 1}   -0.23{col 46}{space 3}0.815{col 54}{space 4}-.7887813{col 67}{space 3} .6201739
{txt}{space 7}4111  {c |}{col 14}{res}{space 2}-.4921701{col 26}{space 2} .5041574{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4}-1.480695{col 67}{space 3} .4963548
{txt}{space 7}4112  {c |}{col 14}{res}{space 2} .3175354{col 26}{space 2} .3495507{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.3678449{col 67}{space 3} 1.002916
{txt}{space 7}4113  {c |}{col 14}{res}{space 2} .6893619{col 26}{space 2} .4430138{col 37}{space 1}    1.56{col 46}{space 3}0.120{col 54}{space 4}-.1792759{col 67}{space 3}    1.558
{txt}{space 7}4114  {c |}{col 14}{res}{space 2}-.6275208{col 26}{space 2} .6485866{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-1.899235{col 67}{space 3}  .644193
{txt}{space 7}4115  {c |}{col 14}{res}{space 2} 1.694947{col 26}{space 2} .5043398{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4}  .706064{col 67}{space 3} 2.683829
{txt}{space 7}4116  {c |}{col 14}{res}{space 2} .7393938{col 26}{space 2} .6482004{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-.5315628{col 67}{space 3}  2.01035
{txt}{space 7}4117  {c |}{col 14}{res}{space 2}-.6724347{col 26}{space 2}  .393654{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4} -1.44429{col 67}{space 3}  .099421
{txt}{space 7}4118  {c |}{col 14}{res}{space 2} .4207291{col 26}{space 2} .3570949{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.2794435{col 67}{space 3} 1.120902
{txt}{space 7}4121  {c |}{col 14}{res}{space 2}-.1171843{col 26}{space 2} .3394012{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-.7826639{col 67}{space 3} .5482954
{txt}{space 7}4125  {c |}{col 14}{res}{space 2} .0290606{col 26}{space 2} .3379014{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}-.6334784{col 67}{space 3} .6915996
{txt}{space 7}4126  {c |}{col 14}{res}{space 2} .7076138{col 26}{space 2} .6571586{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.5809075{col 67}{space 3} 1.996135
{txt}{space 7}4128  {c |}{col 14}{res}{space 2}-.9445122{col 26}{space 2} .6621847{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-2.242889{col 67}{space 3} .3538642
{txt}{space 7}4129  {c |}{col 14}{res}{space 2}-.0275064{col 26}{space 2} .3421876{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-.6984495{col 67}{space 3} .6434367
{txt}{space 7}4130  {c |}{col 14}{res}{space 2}-.4679709{col 26}{space 2} .3395502{col 37}{space 1}   -1.38{col 46}{space 3}0.168{col 54}{space 4}-1.133743{col 67}{space 3}  .197801
{txt}{space 7}4132  {c |}{col 14}{res}{space 2} .9474299{col 26}{space 2} .3582454{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .2450015{col 67}{space 3} 1.649858
{txt}{space 7}4133  {c |}{col 14}{res}{space 2} .4415725{col 26}{space 2} .3457582{col 37}{space 1}    1.28{col 46}{space 3}0.202{col 54}{space 4}-.2363717{col 67}{space 3} 1.119517
{txt}{space 7}4136  {c |}{col 14}{res}{space 2} .1456099{col 26}{space 2} .4166594{col 37}{space 1}    0.35{col 46}{space 3}0.727{col 54}{space 4}-.6713535{col 67}{space 3} .9625733
{txt}{space 7}4138  {c |}{col 14}{res}{space 2} .3172215{col 26}{space 2}  .395368{col 37}{space 1}    0.80{col 46}{space 3}0.422{col 54}{space 4}-.4579948{col 67}{space 3} 1.092438
{txt}{space 7}4142  {c |}{col 14}{res}{space 2} .1230618{col 26}{space 2} .3368888{col 37}{space 1}    0.37{col 46}{space 3}0.715{col 54}{space 4}-.5374918{col 67}{space 3} .7836154
{txt}{space 7}4148  {c |}{col 14}{res}{space 2} .3433602{col 26}{space 2} .3378779{col 37}{space 1}    1.02{col 46}{space 3}0.310{col 54}{space 4}-.3191326{col 67}{space 3} 1.005853
{txt}{space 7}4149  {c |}{col 14}{res}{space 2}-.2162931{col 26}{space 2}  .377785{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-.9570338{col 67}{space 3} .5244475
{txt}{space 7}4154  {c |}{col 14}{res}{space 2} .7637142{col 26}{space 2} .5054625{col 37}{space 1}    1.51{col 46}{space 3}0.131{col 54}{space 4}-.2273696{col 67}{space 3} 1.754798
{txt}{space 7}4155  {c |}{col 14}{res}{space 2} .0742814{col 26}{space 2} .3408898{col 37}{space 1}    0.22{col 46}{space 3}0.828{col 54}{space 4}-.5941171{col 67}{space 3} .7426799
{txt}{space 7}4156  {c |}{col 14}{res}{space 2}-.1550838{col 26}{space 2} .3674983{col 37}{space 1}   -0.42{col 46}{space 3}0.673{col 54}{space 4}-.8756548{col 67}{space 3} .5654871
{txt}{space 7}4157  {c |}{col 14}{res}{space 2} .6709394{col 26}{space 2} .3367335{col 37}{space 1}    1.99{col 46}{space 3}0.046{col 54}{space 4} .0106905{col 67}{space 3} 1.331188
{txt}{space 7}4158  {c |}{col 14}{res}{space 2}-.1353293{col 26}{space 2} .6501087{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-1.410028{col 67}{space 3} 1.139369
{txt}{space 7}4159  {c |}{col 14}{res}{space 2} .3406372{col 26}{space 2} .3377097{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.3215259{col 67}{space 3}   1.0028
{txt}{space 7}4163  {c |}{col 14}{res}{space 2} .6153601{col 26}{space 2} .3415819{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0543955{col 67}{space 3} 1.285116
{txt}{space 7}4164  {c |}{col 14}{res}{space 2} .3832159{col 26}{space 2} .3759286{col 37}{space 1}    1.02{col 46}{space 3}0.308{col 54}{space 4}-.3538848{col 67}{space 3} 1.120317
{txt}{space 7}4165  {c |}{col 14}{res}{space 2} 1.045824{col 26}{space 2} .4475602{col 37}{space 1}    2.34{col 46}{space 3}0.020{col 54}{space 4} .1682715{col 67}{space 3} 1.923376
{txt}{space 7}4167  {c |}{col 14}{res}{space 2}-.0263778{col 26}{space 2}  .345966{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.7047294{col 67}{space 3} .6519739
{txt}{space 7}4168  {c |}{col 14}{res}{space 2} .4722909{col 26}{space 2} .3584983{col 37}{space 1}    1.32{col 46}{space 3}0.188{col 54}{space 4}-.2306334{col 67}{space 3} 1.175215
{txt}{space 7}4169  {c |}{col 14}{res}{space 2} .8304236{col 26}{space 2} .6505313{col 37}{space 1}    1.28{col 46}{space 3}0.202{col 54}{space 4}-.4451032{col 67}{space 3}  2.10595
{txt}{space 7}4179  {c |}{col 14}{res}{space 2}-.1942709{col 26}{space 2} .3440137{col 37}{space 1}   -0.56{col 46}{space 3}0.572{col 54}{space 4}-.8687946{col 67}{space 3} .4802527
{txt}{space 7}4180  {c |}{col 14}{res}{space 2} .2971192{col 26}{space 2} .3667268{col 37}{space 1}    0.81{col 46}{space 3}0.418{col 54}{space 4} -.421939{col 67}{space 3} 1.016177
{txt}{space 7}4185  {c |}{col 14}{res}{space 2} .2739254{col 26}{space 2}  .348559{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}-.4095104{col 67}{space 3} .9573611
{txt}{space 7}4186  {c |}{col 14}{res}{space 2}-.4486995{col 26}{space 2} .3372321{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-1.109926{col 67}{space 3} .2125271
{txt}{space 7}4187  {c |}{col 14}{res}{space 2}-.0613969{col 26}{space 2} .3412638{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.7305287{col 67}{space 3} .6077349
{txt}{space 7}4191  {c |}{col 14}{res}{space 2} .2060921{col 26}{space 2} .6480507{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 54}{space 4}-1.064571{col 67}{space 3} 1.476755
{txt}{space 7}4193  {c |}{col 14}{res}{space 2}-.4554796{col 26}{space 2} .3909759{col 37}{space 1}   -1.16{col 46}{space 3}0.244{col 54}{space 4}-1.222084{col 67}{space 3}  .311125
{txt}{space 7}4196  {c |}{col 14}{res}{space 2} .0997527{col 26}{space 2} .3387939{col 37}{space 1}    0.29{col 46}{space 3}0.768{col 54}{space 4}-.5645362{col 67}{space 3} .7640417
{txt}{space 7}4197  {c |}{col 14}{res}{space 2} -.315578{col 26}{space 2} .3433858{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.9888705{col 67}{space 3} .3577146
{txt}{space 7}4198  {c |}{col 14}{res}{space 2} .6024714{col 26}{space 2}  .503078{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4}-.3839369{col 67}{space 3}  1.58888
{txt}{space 7}4199  {c |}{col 14}{res}{space 2} .1903764{col 26}{space 2} .3430919{col 37}{space 1}    0.55{col 46}{space 3}0.579{col 54}{space 4}-.4823399{col 67}{space 3} .8630928
{txt}{space 7}4200  {c |}{col 14}{res}{space 2}  .597449{col 26}{space 2} .3529262{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0945498{col 67}{space 3} 1.289448
{txt}{space 7}4201  {c |}{col 14}{res}{space 2}-.2992363{col 26}{space 2} .5046935{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4}-1.288812{col 67}{space 3} .6903396
{txt}{space 7}4202  {c |}{col 14}{res}{space 2} .0360902{col 26}{space 2} .3484465{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4} -.647125{col 67}{space 3} .7193055
{txt}{space 7}4205  {c |}{col 14}{res}{space 2}  .152475{col 26}{space 2} .3654555{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.5640906{col 67}{space 3} .8690407
{txt}{space 7}4208  {c |}{col 14}{res}{space 2} .1714768{col 26}{space 2} .3366816{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4}-.4886705{col 67}{space 3} .8316241
{txt}{space 7}4209  {c |}{col 14}{res}{space 2} .1804251{col 26}{space 2} .3371821{col 37}{space 1}    0.54{col 46}{space 3}0.593{col 54}{space 4}-.4807035{col 67}{space 3} .8415537
{txt}{space 7}4212  {c |}{col 14}{res}{space 2} .5812227{col 26}{space 2} .3378798{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-.0812738{col 67}{space 3} 1.243719
{txt}{space 7}4217  {c |}{col 14}{res}{space 2}-.6487515{col 26}{space 2} .5041929{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-1.637346{col 67}{space 3} .3398429
{txt}{space 7}4219  {c |}{col 14}{res}{space 2}  .275975{col 26}{space 2} .3395762{col 37}{space 1}    0.81{col 46}{space 3}0.416{col 54}{space 4}-.3898477{col 67}{space 3} .9417978
{txt}{space 7}4220  {c |}{col 14}{res}{space 2} .0272503{col 26}{space 2} .3396404{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}-.6386984{col 67}{space 3}  .693199
{txt}{space 7}4222  {c |}{col 14}{res}{space 2} .6850122{col 26}{space 2} .3575517{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4} -.016056{col 67}{space 3}  1.38608
{txt}{space 7}4224  {c |}{col 14}{res}{space 2}-.0884501{col 26}{space 2} .3711357{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-.8161531{col 67}{space 3}  .639253
{txt}{space 7}4227  {c |}{col 14}{res}{space 2}-.8237103{col 26}{space 2} .4787516{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-1.762421{col 67}{space 3} .1150002
{txt}{space 7}4229  {c |}{col 14}{res}{space 2}-.3244417{col 26}{space 2} .3439582{col 37}{space 1}   -0.94{col 46}{space 3}0.346{col 54}{space 4}-.9988565{col 67}{space 3} .3499732
{txt}{space 7}4231  {c |}{col 14}{res}{space 2} .0584814{col 26}{space 2} .3838998{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.6942488{col 67}{space 3} .8112116
{txt}{space 7}4233  {c |}{col 14}{res}{space 2}-.1679825{col 26}{space 2} .3438873{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-.8422583{col 67}{space 3} .5062932
{txt}{space 7}4243  {c |}{col 14}{res}{space 2} 1.344531{col 26}{space 2}  .457829{col 37}{space 1}    2.94{col 46}{space 3}0.003{col 54}{space 4} .4468447{col 67}{space 3} 2.242218
{txt}{space 7}4248  {c |}{col 14}{res}{space 2} 1.692643{col 26}{space 2} .7035463{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .3131672{col 67}{space 3} 3.072119
{txt}{space 7}4250  {c |}{col 14}{res}{space 2} 1.045886{col 26}{space 2} .4102135{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .2415609{col 67}{space 3}  1.85021
{txt}{space 7}4251  {c |}{col 14}{res}{space 2} 1.420938{col 26}{space 2} .3568745{col 37}{space 1}    3.98{col 46}{space 3}0.000{col 54}{space 4}  .721198{col 67}{space 3} 2.120679
{txt}{space 7}4253  {c |}{col 14}{res}{space 2} 1.324637{col 26}{space 2} .5679862{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} .2109603{col 67}{space 3} 2.438314
{txt}{space 7}4261  {c |}{col 14}{res}{space 2} 1.526461{col 26}{space 2} .5722621{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4} .4044005{col 67}{space 3} 2.648522
{txt}{space 7}4265  {c |}{col 14}{res}{space 2} 1.676901{col 26}{space 2}  .702977{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .2985409{col 67}{space 3}  3.05526
{txt}{space 7}4269  {c |}{col 14}{res}{space 2} 2.110549{col 26}{space 2} .7025269{col 37}{space 1}    3.00{col 46}{space 3}0.003{col 54}{space 4}  .733072{col 67}{space 3} 3.488026
{txt}{space 7}4270  {c |}{col 14}{res}{space 2} 1.873608{col 26}{space 2} .7032858{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .4946426{col 67}{space 3} 3.252573
{txt}{space 7}4273  {c |}{col 14}{res}{space 2} 1.544008{col 26}{space 2} .4042099{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} .7514554{col 67}{space 3} 2.336561
{txt}{space 7}4276  {c |}{col 14}{res}{space 2} 1.343752{col 26}{space 2} .5071688{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .3493225{col 67}{space 3} 2.338181
{txt}{space 7}4277  {c |}{col 14}{res}{space 2} 1.271161{col 26}{space 2} .3795117{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .5270349{col 67}{space 3} 2.015288
{txt}{space 7}4279  {c |}{col 14}{res}{space 2} .8954023{col 26}{space 2} .4138172{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0840117{col 67}{space 3} 1.706793
{txt}{space 7}4284  {c |}{col 14}{res}{space 2} 1.618113{col 26}{space 2} .4909081{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .6555672{col 67}{space 3}  2.58066
{txt}{space 7}4286  {c |}{col 14}{res}{space 2} 1.243695{col 26}{space 2}  .703065{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4} -.134837{col 67}{space 3} 2.622227
{txt}{space 7}4290  {c |}{col 14}{res}{space 2} 2.435093{col 26}{space 2} .7036704{col 37}{space 1}    3.46{col 46}{space 3}0.001{col 54}{space 4} 1.055374{col 67}{space 3} 3.814812
{txt}{space 7}4291  {c |}{col 14}{res}{space 2} 1.589674{col 26}{space 2} .5641235{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .4835705{col 67}{space 3} 2.695777
{txt}{space 7}4293  {c |}{col 14}{res}{space 2} .5424098{col 26}{space 2} .5611585{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-.5578798{col 67}{space 3} 1.642699
{txt}{space 7}4294  {c |}{col 14}{res}{space 2} 1.531171{col 26}{space 2} .4184219{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .7107517{col 67}{space 3}  2.35159
{txt}{space 7}4297  {c |}{col 14}{res}{space 2} .7592891{col 26}{space 2} .3778375{col 37}{space 1}    2.01{col 46}{space 3}0.045{col 54}{space 4} .0184455{col 67}{space 3} 1.500133
{txt}{space 7}4299  {c |}{col 14}{res}{space 2} .2062146{col 26}{space 2} .3390863{col 37}{space 1}    0.61{col 46}{space 3}0.543{col 54}{space 4}-.4586477{col 67}{space 3} .8710769
{txt}{space 7}4300  {c |}{col 14}{res}{space 2} .1289557{col 26}{space 2}  .343795{col 37}{space 1}    0.38{col 46}{space 3}0.708{col 54}{space 4} -.545139{col 67}{space 3} .8030504
{txt}{space 7}4301  {c |}{col 14}{res}{space 2} .2558831{col 26}{space 2} .3542581{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-.4387271{col 67}{space 3} .9504933
{txt}{space 7}4302  {c |}{col 14}{res}{space 2} .8738843{col 26}{space 2} .3496773{col 37}{space 1}    2.50{col 46}{space 3}0.013{col 54}{space 4} .1882558{col 67}{space 3} 1.559513
{txt}{space 7}4304  {c |}{col 14}{res}{space 2} .8064215{col 26}{space 2} .3515439{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .1171331{col 67}{space 3}  1.49571
{txt}{space 7}4305  {c |}{col 14}{res}{space 2}-.2762362{col 26}{space 2} .3619044{col 37}{space 1}   -0.76{col 46}{space 3}0.445{col 54}{space 4}-.9858391{col 67}{space 3} .4333666
{txt}{space 7}4306  {c |}{col 14}{res}{space 2} .6052025{col 26}{space 2} .3375438{col 37}{space 1}    1.79{col 46}{space 3}0.073{col 54}{space 4}-.0566353{col 67}{space 3}  1.26704
{txt}{space 7}4307  {c |}{col 14}{res}{space 2} .4742488{col 26}{space 2} .3441118{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.2004672{col 67}{space 3} 1.148965
{txt}{space 7}4308  {c |}{col 14}{res}{space 2} .0236997{col 26}{space 2} .3657811{col 37}{space 1}    0.06{col 46}{space 3}0.948{col 54}{space 4}-.6935043{col 67}{space 3} .7409036
{txt}{space 7}4309  {c |}{col 14}{res}{space 2} .6506148{col 26}{space 2} .3645025{col 37}{space 1}    1.78{col 46}{space 3}0.074{col 54}{space 4}-.0640821{col 67}{space 3} 1.365312
{txt}{space 7}4310  {c |}{col 14}{res}{space 2} .1299619{col 26}{space 2}  .416399{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4} -.686491{col 67}{space 3} .9464149
{txt}{space 7}4312  {c |}{col 14}{res}{space 2} 1.568111{col 26}{space 2} .6480194{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4} .2975097{col 67}{space 3} 2.838713
{txt}{space 7}4314  {c |}{col 14}{res}{space 2} .8988459{col 26}{space 2} .4162717{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0826425{col 67}{space 3} 1.715049
{txt}{space 7}4315  {c |}{col 14}{res}{space 2} .1481389{col 26}{space 2} .3763881{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4}-.5898626{col 67}{space 3} .8861405
{txt}{space 7}4317  {c |}{col 14}{res}{space 2} 2.046801{col 26}{space 2} .6570436{col 37}{space 1}    3.12{col 46}{space 3}0.002{col 54}{space 4} .7585054{col 67}{space 3} 3.335097
{txt}{space 7}4318  {c |}{col 14}{res}{space 2} .7792606{col 26}{space 2} .3647239{col 37}{space 1}    2.14{col 46}{space 3}0.033{col 54}{space 4} .0641296{col 67}{space 3} 1.494392
{txt}{space 7}4319  {c |}{col 14}{res}{space 2} .7152404{col 26}{space 2}  .347355{col 37}{space 1}    2.06{col 46}{space 3}0.040{col 54}{space 4} .0341653{col 67}{space 3} 1.396315
{txt}{space 7}4320  {c |}{col 14}{res}{space 2}-.6335927{col 26}{space 2} .4100245{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-1.437547{col 67}{space 3} .1703614
{txt}{space 7}4323  {c |}{col 14}{res}{space 2}-.1116809{col 26}{space 2} .3580593{col 37}{space 1}   -0.31{col 46}{space 3}0.755{col 54}{space 4}-.8137445{col 67}{space 3} .5903826
{txt}{space 7}4324  {c |}{col 14}{res}{space 2} 1.176632{col 26}{space 2} .4531858{col 37}{space 1}    2.60{col 46}{space 3}0.009{col 54}{space 4} .2880493{col 67}{space 3} 2.065214
{txt}{space 7}4325  {c |}{col 14}{res}{space 2} 1.848659{col 26}{space 2} .4500291{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4} .9662659{col 67}{space 3} 2.731052
{txt}{space 7}4326  {c |}{col 14}{res}{space 2} .6537223{col 26}{space 2} .3454443{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4}-.0236063{col 67}{space 3} 1.331051
{txt}{space 7}4330  {c |}{col 14}{res}{space 2} .8363794{col 26}{space 2} .3555096{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .1393152{col 67}{space 3} 1.533444
{txt}{space 7}4331  {c |}{col 14}{res}{space 2} 1.343145{col 26}{space 2} .6474505{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0736589{col 67}{space 3} 2.612631
{txt}{space 7}4332  {c |}{col 14}{res}{space 2} .6008217{col 26}{space 2} .3737943{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-.1320942{col 67}{space 3} 1.333738
{txt}{space 7}4333  {c |}{col 14}{res}{space 2} .6593736{col 26}{space 2} .3752303{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0763578{col 67}{space 3} 1.395105
{txt}{space 7}4337  {c |}{col 14}{res}{space 2} .7092592{col 26}{space 2}  .445646{col 37}{space 1}    1.59{col 46}{space 3}0.112{col 54}{space 4}-.1645396{col 67}{space 3} 1.583058
{txt}{space 7}4340  {c |}{col 14}{res}{space 2} 1.307355{col 26}{space 2} .6478903{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4} .0370062{col 67}{space 3} 2.577704
{txt}{space 7}4341  {c |}{col 14}{res}{space 2} .8030396{col 26}{space 2} .3454601{col 37}{space 1}    2.32{col 46}{space 3}0.020{col 54}{space 4} .1256799{col 67}{space 3} 1.480399
{txt}{space 7}4344  {c |}{col 14}{res}{space 2} .8393805{col 26}{space 2} .6520109{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.4390475{col 67}{space 3} 2.117808
{txt}{space 7}4347  {c |}{col 14}{res}{space 2} .5262231{col 26}{space 2} .3823924{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-.2235515{col 67}{space 3} 1.275998
{txt}{space 7}4349  {c |}{col 14}{res}{space 2}-.7316527{col 26}{space 2} .6538419{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-2.013671{col 67}{space 3} .5503653
{txt}{space 7}4350  {c |}{col 14}{res}{space 2} .8195378{col 26}{space 2} .6538978{col 37}{space 1}    1.25{col 46}{space 3}0.210{col 54}{space 4}-.4625901{col 67}{space 3} 2.101666
{txt}{space 7}4351  {c |}{col 14}{res}{space 2} 1.395409{col 26}{space 2} .6535595{col 37}{space 1}    2.14{col 46}{space 3}0.033{col 54}{space 4} .1139441{col 67}{space 3} 2.676873
{txt}{space 7}4354  {c |}{col 14}{res}{space 2} -.279402{col 26}{space 2} .4263779{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-1.115421{col 67}{space 3}  .556617
{txt}{space 7}4355  {c |}{col 14}{res}{space 2}-.5015139{col 26}{space 2} .3596576{col 37}{space 1}   -1.39{col 46}{space 3}0.163{col 54}{space 4}-1.206711{col 67}{space 3} .2036836
{txt}{space 7}4356  {c |}{col 14}{res}{space 2} .5129308{col 26}{space 2} .3590952{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.1911638{col 67}{space 3} 1.217026
{txt}{space 7}4357  {c |}{col 14}{res}{space 2} .0641079{col 26}{space 2} .3574675{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-.6367951{col 67}{space 3}  .765011
{txt}{space 7}4358  {c |}{col 14}{res}{space 2} .0613128{col 26}{space 2} .3995288{col 37}{space 1}    0.15{col 46}{space 3}0.878{col 54}{space 4}-.7220619{col 67}{space 3} .8446874
{txt}{space 7}4359  {c |}{col 14}{res}{space 2}-.0198477{col 26}{space 2} .4019144{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-.8078999{col 67}{space 3} .7682044
{txt}{space 7}4360  {c |}{col 14}{res}{space 2} .0513194{col 26}{space 2}  .383392{col 37}{space 1}    0.13{col 46}{space 3}0.894{col 54}{space 4}-.7004151{col 67}{space 3} .8030538
{txt}{space 7}4361  {c |}{col 14}{res}{space 2}  -.50282{col 26}{space 2} .3711667{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-1.230584{col 67}{space 3} .2249438
{txt}{space 7}4362  {c |}{col 14}{res}{space 2}-.0297174{col 26}{space 2}  .357357{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4}-.7304039{col 67}{space 3} .6709691
{txt}{space 7}4363  {c |}{col 14}{res}{space 2} .4657974{col 26}{space 2} .3443703{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-.2094255{col 67}{space 3}  1.14102
{txt}{space 7}4365  {c |}{col 14}{res}{space 2} .2080293{col 26}{space 2} .3402485{col 37}{space 1}    0.61{col 46}{space 3}0.541{col 54}{space 4}-.4591116{col 67}{space 3} .8751703
{txt}{space 7}4366  {c |}{col 14}{res}{space 2}-.1382577{col 26}{space 2} .3670843{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-.8580169{col 67}{space 3} .5815015
{txt}{space 7}4368  {c |}{col 14}{res}{space 2} .0123744{col 26}{space 2} .3785093{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-.7297863{col 67}{space 3} .7545351
{txt}{space 7}4369  {c |}{col 14}{res}{space 2} .9102255{col 26}{space 2} .4216051{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0835648{col 67}{space 3} 1.736886
{txt}{space 7}4370  {c |}{col 14}{res}{space 2}-.9562425{col 26}{space 2} .5049465{col 37}{space 1}   -1.89{col 46}{space 3}0.058{col 54}{space 4}-1.946315{col 67}{space 3} .0338296
{txt}{space 7}4371  {c |}{col 14}{res}{space 2} .4062251{col 26}{space 2} .3690196{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-.3173287{col 67}{space 3} 1.129779
{txt}{space 7}4372  {c |}{col 14}{res}{space 2}-.0836683{col 26}{space 2} .4034362{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.8747044{col 67}{space 3} .7073678
{txt}{space 7}4373  {c |}{col 14}{res}{space 2} .3877592{col 26}{space 2} .4127038{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.4214484{col 67}{space 3} 1.196967
{txt}{space 7}4375  {c |}{col 14}{res}{space 2} .6030303{col 26}{space 2} .3705997{col 37}{space 1}    1.63{col 46}{space 3}0.104{col 54}{space 4}-.1236218{col 67}{space 3} 1.329682
{txt}{space 7}4376  {c |}{col 14}{res}{space 2}  .192256{col 26}{space 2} .3501609{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 54}{space 4}-.4943206{col 67}{space 3} .8788326
{txt}{space 7}4377  {c |}{col 14}{res}{space 2} .0050761{col 26}{space 2} .3782477{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-.7365717{col 67}{space 3} .7467238
{txt}{space 7}4378  {c |}{col 14}{res}{space 2}-.0841189{col 26}{space 2}  .355996{col 37}{space 1}   -0.24{col 46}{space 3}0.813{col 54}{space 4}-.7821368{col 67}{space 3}  .613899
{txt}{space 7}4379  {c |}{col 14}{res}{space 2}  1.09173{col 26}{space 2}  .503115{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .1052495{col 67}{space 3} 2.078211
{txt}{space 7}4380  {c |}{col 14}{res}{space 2} .3947175{col 26}{space 2} .3596093{col 37}{space 1}    1.10{col 46}{space 3}0.272{col 54}{space 4}-.3103851{col 67}{space 3}  1.09982
{txt}{space 7}4381  {c |}{col 14}{res}{space 2}-.3112606{col 26}{space 2} .3763949{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-1.049276{col 67}{space 3} .4267544
{txt}{space 7}4382  {c |}{col 14}{res}{space 2}-.2845994{col 26}{space 2} .3562747{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-.9831637{col 67}{space 3} .4139649
{txt}{space 7}4383  {c |}{col 14}{res}{space 2}-.4855654{col 26}{space 2} .3747699{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-1.220394{col 67}{space 3} .2492634
{txt}{space 7}4384  {c |}{col 14}{res}{space 2}-.3952999{col 26}{space 2}   .39223{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-1.164363{col 67}{space 3} .3737636
{txt}{space 7}4385  {c |}{col 14}{res}{space 2} .0905804{col 26}{space 2} .4574351{col 37}{space 1}    0.20{col 46}{space 3}0.843{col 54}{space 4}-.8063339{col 67}{space 3} .9874946
{txt}{space 7}4386  {c |}{col 14}{res}{space 2}-.3664062{col 26}{space 2} .4600507{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-1.268449{col 67}{space 3} .5356365
{txt}{space 7}4387  {c |}{col 14}{res}{space 2} .5243109{col 26}{space 2}  .388503{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-.2374449{col 67}{space 3} 1.286067
{txt}{space 7}4388  {c |}{col 14}{res}{space 2} .1400981{col 26}{space 2} .3743107{col 37}{space 1}    0.37{col 46}{space 3}0.708{col 54}{space 4}-.5938303{col 67}{space 3} .8740264
{txt}{space 7}4389  {c |}{col 14}{res}{space 2} .2449927{col 26}{space 2} .3544703{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4}-.4500338{col 67}{space 3} .9400191
{txt}{space 7}4390  {c |}{col 14}{res}{space 2}-.0003844{col 26}{space 2} .4785921{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-.9387822{col 67}{space 3} .9380134
{txt}{space 7}4391  {c |}{col 14}{res}{space 2} .5668206{col 26}{space 2} .4429396{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.3016717{col 67}{space 3} 1.435313
{txt}{space 7}4392  {c |}{col 14}{res}{space 2}-.1123361{col 26}{space 2} .3743272{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.8462968{col 67}{space 3} .6216247
{txt}{space 7}4393  {c |}{col 14}{res}{space 2} .2423694{col 26}{space 2} .4176572{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 54}{space 4}-.5765505{col 67}{space 3} 1.061289
{txt}{space 7}4394  {c |}{col 14}{res}{space 2}-.3039752{col 26}{space 2}  .389473{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-1.067633{col 67}{space 3} .4596827
{txt}{space 7}4395  {c |}{col 14}{res}{space 2}-.9591604{col 26}{space 2} .3951383{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.733926{col 67}{space 3}-.1843944
{txt}{space 7}4396  {c |}{col 14}{res}{space 2}-.7301734{col 26}{space 2} .3490074{col 37}{space 1}   -2.09{col 46}{space 3}0.037{col 54}{space 4}-1.414488{col 67}{space 3}-.0458584
{txt}{space 7}4397  {c |}{col 14}{res}{space 2}-1.008681{col 26}{space 2} .5074992{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-2.003759{col 67}{space 3}-.0136041
{txt}{space 7}4398  {c |}{col 14}{res}{space 2} .8546869{col 26}{space 2} .6478845{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.4156504{col 67}{space 3} 2.125024
{txt}{space 7}4399  {c |}{col 14}{res}{space 2} .0834947{col 26}{space 2} .3590537{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.6205185{col 67}{space 3}  .787508
{txt}{space 7}4400  {c |}{col 14}{res}{space 2} .1754522{col 26}{space 2} .3395438{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4} -.490307{col 67}{space 3} .8412114
{txt}{space 7}4401  {c |}{col 14}{res}{space 2} .1482757{col 26}{space 2} .3784207{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-.5937114{col 67}{space 3} .8902627
{txt}{space 7}4402  {c |}{col 14}{res}{space 2}-.5117871{col 26}{space 2} .3643704{col 37}{space 1}   -1.40{col 46}{space 3}0.160{col 54}{space 4}-1.226225{col 67}{space 3}  .202651
{txt}{space 7}4403  {c |}{col 14}{res}{space 2}-.4818252{col 26}{space 2} .3895942{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-1.245721{col 67}{space 3} .2820703
{txt}{space 7}4404  {c |}{col 14}{res}{space 2} .8917133{col 26}{space 2} .4460352{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} .0171514{col 67}{space 3} 1.766275
{txt}{space 7}4405  {c |}{col 14}{res}{space 2}-.0250517{col 26}{space 2} .3561365{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-.7233451{col 67}{space 3} .6732416
{txt}{space 7}4406  {c |}{col 14}{res}{space 2}-.0540128{col 26}{space 2} .3762268{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-.7916981{col 67}{space 3} .6836725
{txt}{space 7}4407  {c |}{col 14}{res}{space 2} .9747294{col 26}{space 2} .3713583{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4}   .24659{col 67}{space 3} 1.702869
{txt}{space 7}4408  {c |}{col 14}{res}{space 2} .9710305{col 26}{space 2} .3675863{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4}  .250287{col 67}{space 3} 1.691774
{txt}{space 7}4412  {c |}{col 14}{res}{space 2} .7720608{col 26}{space 2} .6534725{col 37}{space 1}    1.18{col 46}{space 3}0.238{col 54}{space 4}-.5092331{col 67}{space 3} 2.053355
{txt}{space 7}4413  {c |}{col 14}{res}{space 2} .7072716{col 26}{space 2} .6478015{col 37}{space 1}    1.09{col 46}{space 3}0.275{col 54}{space 4}-.5629029{col 67}{space 3} 1.977446
{txt}{space 7}4414  {c |}{col 14}{res}{space 2} .3899474{col 26}{space 2} .6519455{col 37}{space 1}    0.60{col 46}{space 3}0.550{col 54}{space 4}-.8883525{col 67}{space 3} 1.668247
{txt}{space 7}4415  {c |}{col 14}{res}{space 2} 1.174222{col 26}{space 2} .3511528{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .4857003{col 67}{space 3} 1.862743
{txt}{space 7}4416  {c |}{col 14}{res}{space 2} 1.302007{col 26}{space 2} .4465301{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4}  .426475{col 67}{space 3}  2.17754
{txt}{space 7}4418  {c |}{col 14}{res}{space 2} .9950858{col 26}{space 2} .6520286{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4} -.283377{col 67}{space 3} 2.273549
{txt}{space 7}4424  {c |}{col 14}{res}{space 2} .6086148{col 26}{space 2} .5070422{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 54}{space 4}-.3855663{col 67}{space 3} 1.602796
{txt}{space 7}4427  {c |}{col 14}{res}{space 2} .2276718{col 26}{space 2} .5025137{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.7576302{col 67}{space 3} 1.212974
{txt}{space 7}4429  {c |}{col 14}{res}{space 2} .9229203{col 26}{space 2} .5084635{col 37}{space 1}    1.82{col 46}{space 3}0.070{col 54}{space 4}-.0740476{col 67}{space 3} 1.919888
{txt}{space 7}4430  {c |}{col 14}{res}{space 2} .8400792{col 26}{space 2} .3436559{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .1662572{col 67}{space 3} 1.513901
{txt}{space 7}4432  {c |}{col 14}{res}{space 2}-1.112133{col 26}{space 2} .3789572{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4}-1.855172{col 67}{space 3}-.3690942
{txt}{space 7}4433  {c |}{col 14}{res}{space 2} .8538683{col 26}{space 2} .6515897{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4} -.423734{col 67}{space 3}  2.13147
{txt}{space 7}4434  {c |}{col 14}{res}{space 2} .0726524{col 26}{space 2} .3712113{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.6551988{col 67}{space 3} .8005036
{txt}{space 7}4435  {c |}{col 14}{res}{space 2} .4989849{col 26}{space 2} .4169587{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-.3185653{col 67}{space 3} 1.316535
{txt}{space 7}4436  {c |}{col 14}{res}{space 2} .3102645{col 26}{space 2} .5064146{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 54}{space 4}-.6826861{col 67}{space 3} 1.303215
{txt}{space 7}4437  {c |}{col 14}{res}{space 2} 1.349844{col 26}{space 2} .3728697{col 37}{space 1}    3.62{col 46}{space 3}0.000{col 54}{space 4} .6187409{col 67}{space 3} 2.080947
{txt}{space 7}4438  {c |}{col 14}{res}{space 2}  .206654{col 26}{space 2} .3645753{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.5081858{col 67}{space 3} .9214938
{txt}{space 7}4439  {c |}{col 14}{res}{space 2} 1.004767{col 26}{space 2} .3750906{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .2693099{col 67}{space 3} 1.740225
{txt}{space 7}4440  {c |}{col 14}{res}{space 2} .2099374{col 26}{space 2} .3378479{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4}-.4524966{col 67}{space 3} .8723715
{txt}{space 7}4441  {c |}{col 14}{res}{space 2} 1.262636{col 26}{space 2}  .449618{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .3810488{col 67}{space 3} 2.144223
{txt}{space 7}4442  {c |}{col 14}{res}{space 2} .0130634{col 26}{space 2} .6546488{col 37}{space 1}    0.02{col 46}{space 3}0.984{col 54}{space 4}-1.270537{col 67}{space 3} 1.296664
{txt}{space 7}4443  {c |}{col 14}{res}{space 2} .7724579{col 26}{space 2} .4115496{col 37}{space 1}    1.88{col 46}{space 3}0.061{col 54}{space 4}-.0344866{col 67}{space 3} 1.579402
{txt}{space 7}4445  {c |}{col 14}{res}{space 2}-.5230288{col 26}{space 2} .6478634{col 37}{space 1}   -0.81{col 46}{space 3}0.420{col 54}{space 4}-1.793325{col 67}{space 3}  .747267
{txt}{space 7}4448  {c |}{col 14}{res}{space 2}  .419823{col 26}{space 2} .3547081{col 37}{space 1}    1.18{col 46}{space 3}0.237{col 54}{space 4}-.2756697{col 67}{space 3} 1.115316
{txt}{space 7}4449  {c |}{col 14}{res}{space 2}-.2601233{col 26}{space 2} .3614293{col 37}{space 1}   -0.72{col 46}{space 3}0.472{col 54}{space 4}-.9687946{col 67}{space 3}  .448548
{txt}{space 7}4450  {c |}{col 14}{res}{space 2} .6172499{col 26}{space 2} .5040038{col 37}{space 1}    1.22{col 46}{space 3}0.221{col 54}{space 4}-.3709738{col 67}{space 3} 1.605474
{txt}{space 7}4451  {c |}{col 14}{res}{space 2} .0842173{col 26}{space 2} .3602341{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.6221105{col 67}{space 3} .7905451
{txt}{space 7}4453  {c |}{col 14}{res}{space 2} .4527781{col 26}{space 2} .3653292{col 37}{space 1}    1.24{col 46}{space 3}0.215{col 54}{space 4}-.2635399{col 67}{space 3} 1.169096
{txt}{space 7}4455  {c |}{col 14}{res}{space 2} .7620354{col 26}{space 2} .3760199{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} .0247558{col 67}{space 3} 1.499315
{txt}{space 7}4456  {c |}{col 14}{res}{space 2}-1.317099{col 26}{space 2} .6838608{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-2.657976{col 67}{space 3} .0237789
{txt}{space 7}4457  {c |}{col 14}{res}{space 2} -.107269{col 26}{space 2} .4420496{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.9740163{col 67}{space 3} .7594782
{txt}{space 7}4458  {c |}{col 14}{res}{space 2} .4242065{col 26}{space 2} .3805717{col 37}{space 1}    1.11{col 46}{space 3}0.265{col 54}{space 4}-.3219982{col 67}{space 3} 1.170411
{txt}{space 7}4459  {c |}{col 14}{res}{space 2}-.2636558{col 26}{space 2}  .664336{col 37}{space 1}   -0.40{col 46}{space 3}0.691{col 54}{space 4} -1.56625{col 67}{space 3} 1.038939
{txt}{space 7}4460  {c |}{col 14}{res}{space 2}-.8153712{col 26}{space 2} .4068295{col 37}{space 1}   -2.00{col 46}{space 3}0.045{col 54}{space 4}-1.613061{col 67}{space 3}-.0176818
{txt}{space 7}4461  {c |}{col 14}{res}{space 2} .1626507{col 26}{space 2} .4087421{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}-.6387888{col 67}{space 3} .9640902
{txt}{space 7}4462  {c |}{col 14}{res}{space 2} .6769015{col 26}{space 2} .3749196{col 37}{space 1}    1.81{col 46}{space 3}0.071{col 54}{space 4}-.0582207{col 67}{space 3} 1.412024
{txt}{space 7}4463  {c |}{col 14}{res}{space 2} .2066784{col 26}{space 2} .4506681{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.6769676{col 67}{space 3} 1.090324
{txt}{space 7}4464  {c |}{col 14}{res}{space 2} .0179288{col 26}{space 2} .3531636{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-.6745354{col 67}{space 3} .7103931
{txt}{space 7}4465  {c |}{col 14}{res}{space 2}-1.240158{col 26}{space 2} .6489091{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-2.512504{col 67}{space 3}  .032188
{txt}{space 7}4466  {c |}{col 14}{res}{space 2}-.1397514{col 26}{space 2} .3592871{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-.8442223{col 67}{space 3} .5647196
{txt}{space 7}4468  {c |}{col 14}{res}{space 2} .5062137{col 26}{space 2} .4118653{col 37}{space 1}    1.23{col 46}{space 3}0.219{col 54}{space 4}-.3013498{col 67}{space 3} 1.313777
{txt}{space 7}4469  {c |}{col 14}{res}{space 2}  .393941{col 26}{space 2} .3647161{col 37}{space 1}    1.08{col 46}{space 3}0.280{col 54}{space 4}-.3211749{col 67}{space 3} 1.109057
{txt}{space 7}4472  {c |}{col 14}{res}{space 2}-.3666544{col 26}{space 2} .4432366{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-1.235729{col 67}{space 3} .5024202
{txt}{space 7}4473  {c |}{col 14}{res}{space 2} .5657983{col 26}{space 2} .5064853{col 37}{space 1}    1.12{col 46}{space 3}0.264{col 54}{space 4}-.4272909{col 67}{space 3} 1.558888
{txt}{space 7}4474  {c |}{col 14}{res}{space 2} .5545006{col 26}{space 2} .3530225{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4} -.137687{col 67}{space 3} 1.246688
{txt}{space 7}4475  {c |}{col 14}{res}{space 2} -.405768{col 26}{space 2} .4100622{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-1.209796{col 67}{space 3} .3982601
{txt}{space 7}4476  {c |}{col 14}{res}{space 2} .7887429{col 26}{space 2} .4450759{col 37}{space 1}    1.77{col 46}{space 3}0.076{col 54}{space 4}-.0839381{col 67}{space 3} 1.661424
{txt}{space 7}4477  {c |}{col 14}{res}{space 2}-.0207683{col 26}{space 2} .3648537{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.7361538{col 67}{space 3} .6946172
{txt}{space 7}4478  {c |}{col 14}{res}{space 2}-.1022674{col 26}{space 2} .3924712{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.8718039{col 67}{space 3} .6672691
{txt}{space 7}4479  {c |}{col 14}{res}{space 2} -.048403{col 26}{space 2} .3691888{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-.7722887{col 67}{space 3} .6754826
{txt}{space 7}4480  {c |}{col 14}{res}{space 2} .2421784{col 26}{space 2} .3907651{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4}-.5240129{col 67}{space 3}  1.00837
{txt}{space 7}4481  {c |}{col 14}{res}{space 2} .0529309{col 26}{space 2} .3584787{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4} -.649955{col 67}{space 3} .7558169
{txt}{space 7}4482  {c |}{col 14}{res}{space 2} .1678638{col 26}{space 2} .3441582{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.5069432{col 67}{space 3} .8426707
{txt}{space 7}4483  {c |}{col 14}{res}{space 2}-1.066536{col 26}{space 2} .6539414{col 37}{space 1}   -1.63{col 46}{space 3}0.103{col 54}{space 4}-2.348749{col 67}{space 3} .2156776
{txt}{space 7}4484  {c |}{col 14}{res}{space 2} .5209087{col 26}{space 2} .6618182{col 37}{space 1}    0.79{col 46}{space 3}0.431{col 54}{space 4} -.776749{col 67}{space 3} 1.818566
{txt}{space 7}4485  {c |}{col 14}{res}{space 2} .1860951{col 26}{space 2} .6473719{col 37}{space 1}    0.29{col 46}{space 3}0.774{col 54}{space 4}-1.083237{col 67}{space 3} 1.455427
{txt}{space 7}4486  {c |}{col 14}{res}{space 2}-.6523262{col 26}{space 2} .4350032{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-1.505257{col 67}{space 3} .2006047
{txt}{space 7}4487  {c |}{col 14}{res}{space 2}    .8236{col 26}{space 2} .4832562{col 37}{space 1}    1.70{col 46}{space 3}0.088{col 54}{space 4}-.1239429{col 67}{space 3} 1.771143
{txt}{space 7}4488  {c |}{col 14}{res}{space 2}-.0010833{col 26}{space 2} .3382951{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.6643942{col 67}{space 3} .6622275
{txt}{space 7}4491  {c |}{col 14}{res}{space 2}-.3650048{col 26}{space 2} .5031871{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}-1.351627{col 67}{space 3} .6216175
{txt}{space 7}4492  {c |}{col 14}{res}{space 2}-1.129084{col 26}{space 2} .5057144{col 37}{space 1}   -2.23{col 46}{space 3}0.026{col 54}{space 4}-2.120661{col 67}{space 3}-.1375059
{txt}{space 7}4493  {c |}{col 14}{res}{space 2}-.3679119{col 26}{space 2} .3975781{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-1.147462{col 67}{space 3}  .411638
{txt}{space 7}4494  {c |}{col 14}{res}{space 2} .2867977{col 26}{space 2} .3429432{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-.3856269{col 67}{space 3} .9592223
{txt}{space 7}4495  {c |}{col 14}{res}{space 2}-.4817535{col 26}{space 2} .3821648{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-1.231082{col 67}{space 3} .2675748
{txt}{space 7}4497  {c |}{col 14}{res}{space 2} .4993846{col 26}{space 2} .3916511{col 37}{space 1}    1.28{col 46}{space 3}0.202{col 54}{space 4}-.2685439{col 67}{space 3} 1.267313
{txt}{space 7}4498  {c |}{col 14}{res}{space 2}-.1480843{col 26}{space 2} .3711744{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-.8758632{col 67}{space 3} .5796945
{txt}{space 7}4499  {c |}{col 14}{res}{space 2}-.3601784{col 26}{space 2} .5066431{col 37}{space 1}   -0.71{col 46}{space 3}0.477{col 54}{space 4}-1.353577{col 67}{space 3} .6332203
{txt}{space 7}4500  {c |}{col 14}{res}{space 2} .7851666{col 26}{space 2} .3886767{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0230703{col 67}{space 3} 1.547263
{txt}{space 7}4501  {c |}{col 14}{res}{space 2} .1716097{col 26}{space 2} .4663315{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4}-.7427481{col 67}{space 3} 1.085968
{txt}{space 7}4502  {c |}{col 14}{res}{space 2}-.4981823{col 26}{space 2} .3597402{col 37}{space 1}   -1.38{col 46}{space 3}0.166{col 54}{space 4}-1.203542{col 67}{space 3} .2071772
{txt}{space 7}4503  {c |}{col 14}{res}{space 2} .6182559{col 26}{space 2}  .364214{col 37}{space 1}    1.70{col 46}{space 3}0.090{col 54}{space 4}-.0958754{col 67}{space 3} 1.332387
{txt}{space 7}4504  {c |}{col 14}{res}{space 2}-.7326375{col 26}{space 2} .3714205{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-1.460899{col 67}{space 3} -.004376
{txt}{space 7}4505  {c |}{col 14}{res}{space 2} .0619164{col 26}{space 2} .3668069{col 37}{space 1}    0.17{col 46}{space 3}0.866{col 54}{space 4} -.657299{col 67}{space 3} .7811317
{txt}{space 7}4506  {c |}{col 14}{res}{space 2}-.5189393{col 26}{space 2} .4001113{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-1.303456{col 67}{space 3} .2655776
{txt}{space 7}4507  {c |}{col 14}{res}{space 2} .6218598{col 26}{space 2} .3451775{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0549458{col 67}{space 3} 1.298665
{txt}{space 7}4509  {c |}{col 14}{res}{space 2}-.4540605{col 26}{space 2}  .370816{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-1.181137{col 67}{space 3} .2730157
{txt}{space 7}4510  {c |}{col 14}{res}{space 2} .6825346{col 26}{space 2} .6511838{col 37}{space 1}    1.05{col 46}{space 3}0.295{col 54}{space 4}-.5942716{col 67}{space 3} 1.959341
{txt}{space 7}4511  {c |}{col 14}{res}{space 2}-.1218607{col 26}{space 2} .3945233{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4}-.8954208{col 67}{space 3} .6516993
{txt}{space 7}4513  {c |}{col 14}{res}{space 2} .9487859{col 26}{space 2} .5090174{col 37}{space 1}    1.86{col 46}{space 3}0.062{col 54}{space 4}-.0492681{col 67}{space 3}  1.94684
{txt}{space 7}4514  {c |}{col 14}{res}{space 2} .8042399{col 26}{space 2} .4128777{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}-.0053086{col 67}{space 3} 1.613788
{txt}{space 7}4515  {c |}{col 14}{res}{space 2} .5824689{col 26}{space 2} .6516815{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4}-.6953132{col 67}{space 3} 1.860251
{txt}{space 7}4516  {c |}{col 14}{res}{space 2} .7512492{col 26}{space 2}  .443348{col 37}{space 1}    1.69{col 46}{space 3}0.090{col 54}{space 4}-.1180439{col 67}{space 3} 1.620542
{txt}{space 7}4517  {c |}{col 14}{res}{space 2} .0180236{col 26}{space 2} .4461436{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-.8567508{col 67}{space 3} .8927981
{txt}{space 7}4519  {c |}{col 14}{res}{space 2} 1.260671{col 26}{space 2} .5082126{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .2641944{col 67}{space 3} 2.257147
{txt}{space 7}4521  {c |}{col 14}{res}{space 2} 1.297124{col 26}{space 2} .3872474{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .5378298{col 67}{space 3} 2.056418
{txt}{space 7}4525  {c |}{col 14}{res}{space 2}  .724281{col 26}{space 2} .3711479{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4} -.003446{col 67}{space 3} 1.452008
{txt}{space 7}4527  {c |}{col 14}{res}{space 2} .7341672{col 26}{space 2} .3667309{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4} .0151008{col 67}{space 3} 1.453234
{txt}{space 7}4528  {c |}{col 14}{res}{space 2} .8240854{col 26}{space 2} .3717744{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} .0951301{col 67}{space 3} 1.553041
{txt}{space 7}4531  {c |}{col 14}{res}{space 2} .8134156{col 26}{space 2}  .368592{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0907002{col 67}{space 3} 1.536131
{txt}{space 7}4532  {c |}{col 14}{res}{space 2}   .36244{col 26}{space 2} .3955295{col 37}{space 1}    0.92{col 46}{space 3}0.360{col 54}{space 4} -.413093{col 67}{space 3} 1.137973
{txt}{space 7}4533  {c |}{col 14}{res}{space 2} .8699204{col 26}{space 2} .3930615{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0992265{col 67}{space 3} 1.640614
{txt}{space 7}4534  {c |}{col 14}{res}{space 2}-.1191907{col 26}{space 2} .5208479{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-1.140441{col 67}{space 3} .9020599
{txt}{space 7}4535  {c |}{col 14}{res}{space 2}-.3216482{col 26}{space 2} .3762765{col 37}{space 1}   -0.85{col 46}{space 3}0.393{col 54}{space 4}-1.059431{col 67}{space 3} .4161345
{txt}{space 7}4538  {c |}{col 14}{res}{space 2}-.2399867{col 26}{space 2} .6497491{col 37}{space 1}   -0.37{col 46}{space 3}0.712{col 54}{space 4} -1.51398{col 67}{space 3} 1.034007
{txt}{space 7}4539  {c |}{col 14}{res}{space 2} .2639341{col 26}{space 2} .3652837{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-.4522946{col 67}{space 3} .9801628
{txt}{space 7}4540  {c |}{col 14}{res}{space 2}-.3140982{col 26}{space 2} .5042301{col 37}{space 1}   -0.62{col 46}{space 3}0.533{col 54}{space 4}-1.302766{col 67}{space 3} .6745691
{txt}{space 7}4541  {c |}{col 14}{res}{space 2} .5395504{col 26}{space 2} .3769447{col 37}{space 1}    1.43{col 46}{space 3}0.152{col 54}{space 4}-.1995427{col 67}{space 3} 1.278643
{txt}{space 7}4543  {c |}{col 14}{res}{space 2} .5269746{col 26}{space 2} .3398421{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.1393697{col 67}{space 3} 1.193319
{txt}{space 7}4544  {c |}{col 14}{res}{space 2} 1.097833{col 26}{space 2} .4441661{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .2269355{col 67}{space 3}  1.96873
{txt}{space 7}4545  {c |}{col 14}{res}{space 2} .1520401{col 26}{space 2} .3383482{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.5113748{col 67}{space 3} .8154551
{txt}{space 7}4546  {c |}{col 14}{res}{space 2} .6975239{col 26}{space 2} .3648799{col 37}{space 1}    1.91{col 46}{space 3}0.056{col 54}{space 4} -.017913{col 67}{space 3} 1.412961
{txt}{space 7}4547  {c |}{col 14}{res}{space 2}-.1521348{col 26}{space 2}  .355611{col 37}{space 1}   -0.43{col 46}{space 3}0.669{col 54}{space 4}-.8493978{col 67}{space 3} .5451282
{txt}{space 7}4548  {c |}{col 14}{res}{space 2} .5565303{col 26}{space 2} .3789095{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.1864151{col 67}{space 3} 1.299476
{txt}{space 7}4551  {c |}{col 14}{res}{space 2} .6753101{col 26}{space 2} .4134065{col 37}{space 1}    1.63{col 46}{space 3}0.102{col 54}{space 4}-.1352752{col 67}{space 3} 1.485895
{txt}{space 7}4552  {c |}{col 14}{res}{space 2}  .582117{col 26}{space 2} .3918142{col 37}{space 1}    1.49{col 46}{space 3}0.137{col 54}{space 4}-.1861313{col 67}{space 3} 1.350365
{txt}{space 7}4556  {c |}{col 14}{res}{space 2} -.305668{col 26}{space 2} .4445197{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-1.177258{col 67}{space 3} .5659225
{txt}{space 7}4557  {c |}{col 14}{res}{space 2} .1339262{col 26}{space 2} .3882089{col 37}{space 1}    0.34{col 46}{space 3}0.730{col 54}{space 4} -.627253{col 67}{space 3} .8951053
{txt}{space 7}4559  {c |}{col 14}{res}{space 2}-.1671699{col 26}{space 2} .3648952{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-.8826368{col 67}{space 3}  .548297
{txt}{space 7}4560  {c |}{col 14}{res}{space 2}  .058406{col 26}{space 2} .3481277{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4}-.6241841{col 67}{space 3} .7409962
{txt}{space 7}4561  {c |}{col 14}{res}{space 2}-.0073047{col 26}{space 2} .3535814{col 37}{space 1}   -0.02{col 46}{space 3}0.984{col 54}{space 4}-.7005882{col 67}{space 3} .6859787
{txt}{space 7}4562  {c |}{col 14}{res}{space 2} .5546724{col 26}{space 2} .4122916{col 37}{space 1}    1.35{col 46}{space 3}0.179{col 54}{space 4}-.2537268{col 67}{space 3} 1.363072
{txt}{space 7}4563  {c |}{col 14}{res}{space 2}-.3718815{col 26}{space 2} .3916799{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-1.139866{col 67}{space 3} .3961035
{txt}{space 7}4566  {c |}{col 14}{res}{space 2}-.3070276{col 26}{space 2} .3545619{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 54}{space 4}-1.002234{col 67}{space 3} .3881784
{txt}{space 7}4567  {c |}{col 14}{res}{space 2} .0048565{col 26}{space 2} .3585165{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-.6981034{col 67}{space 3} .7078164
{txt}{space 7}4568  {c |}{col 14}{res}{space 2} .0944835{col 26}{space 2} .3532223{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.5980958{col 67}{space 3} .7870628
{txt}{space 7}4569  {c |}{col 14}{res}{space 2}-.1799785{col 26}{space 2} .3823582{col 37}{space 1}   -0.47{col 46}{space 3}0.638{col 54}{space 4}-.9296861{col 67}{space 3}  .569729
{txt}{space 7}4570  {c |}{col 14}{res}{space 2} .0553315{col 26}{space 2}  .349889{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-.6307121{col 67}{space 3}  .741375
{txt}{space 7}4571  {c |}{col 14}{res}{space 2}-.2941388{col 26}{space 2} .4117734{col 37}{space 1}   -0.71{col 46}{space 3}0.475{col 54}{space 4}-1.101522{col 67}{space 3} .5132445
{txt}{space 7}4572  {c |}{col 14}{res}{space 2} .0656199{col 26}{space 2} .3848883{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.6890485{col 67}{space 3} .8202882
{txt}{space 7}4573  {c |}{col 14}{res}{space 2} .3783294{col 26}{space 2} .3953831{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.3969166{col 67}{space 3} 1.153575
{txt}{space 7}4574  {c |}{col 14}{res}{space 2}-.2455613{col 26}{space 2} .6473577{col 37}{space 1}   -0.38{col 46}{space 3}0.704{col 54}{space 4}-1.514866{col 67}{space 3} 1.023743
{txt}{space 7}4575  {c |}{col 14}{res}{space 2}-.5962347{col 26}{space 2}  .357072{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-1.296362{col 67}{space 3} .1038929
{txt}{space 7}4576  {c |}{col 14}{res}{space 2} -.148016{col 26}{space 2} .3686413{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.8708282{col 67}{space 3} .5747962
{txt}{space 7}4577  {c |}{col 14}{res}{space 2} -.158247{col 26}{space 2} .3902304{col 37}{space 1}   -0.41{col 46}{space 3}0.685{col 54}{space 4}-.9233899{col 67}{space 3} .6068958
{txt}{space 7}4578  {c |}{col 14}{res}{space 2} -.585167{col 26}{space 2} .4009934{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-1.371413{col 67}{space 3} .2010794
{txt}{space 7}4579  {c |}{col 14}{res}{space 2} .1173805{col 26}{space 2} .5037545{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.8703544{col 67}{space 3} 1.105115
{txt}{space 7}4581  {c |}{col 14}{res}{space 2}-.5100715{col 26}{space 2} .3960875{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-1.286699{col 67}{space 3} .2665556
{txt}{space 7}4582  {c |}{col 14}{res}{space 2}-.4298897{col 26}{space 2} .3575828{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-1.131019{col 67}{space 3} .2712395
{txt}{space 7}4583  {c |}{col 14}{res}{space 2}-.2015169{col 26}{space 2} .3641394{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-.9155019{col 67}{space 3} .5124681
{txt}{space 7}4584  {c |}{col 14}{res}{space 2} -.426844{col 26}{space 2} .5109924{col 37}{space 1}   -0.84{col 46}{space 3}0.404{col 54}{space 4} -1.42877{col 67}{space 3} .5750825
{txt}{space 7}4585  {c |}{col 14}{res}{space 2} .0364127{col 26}{space 2} .3786297{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-.7059841{col 67}{space 3} .7788096
{txt}{space 7}4586  {c |}{col 14}{res}{space 2} .1456492{col 26}{space 2} .3609814{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-.5621437{col 67}{space 3} .8534422
{txt}{space 7}4587  {c |}{col 14}{res}{space 2}-.3042079{col 26}{space 2} .3591459{col 37}{space 1}   -0.85{col 46}{space 3}0.397{col 54}{space 4}-1.008402{col 67}{space 3} .3999862
{txt}{space 7}4588  {c |}{col 14}{res}{space 2}-.5263549{col 26}{space 2} .5035986{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-1.513784{col 67}{space 3} .4610743
{txt}{space 7}4589  {c |}{col 14}{res}{space 2} .6961351{col 26}{space 2} .5026912{col 37}{space 1}    1.38{col 46}{space 3}0.166{col 54}{space 4} -.289515{col 67}{space 3} 1.681785
{txt}{space 7}4590  {c |}{col 14}{res}{space 2} .2979366{col 26}{space 2} .3748325{col 37}{space 1}    0.79{col 46}{space 3}0.427{col 54}{space 4} -.437015{col 67}{space 3} 1.032888
{txt}{space 7}4591  {c |}{col 14}{res}{space 2} .7607007{col 26}{space 2} .3564653{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .0617627{col 67}{space 3} 1.459639
{txt}{space 7}4593  {c |}{col 14}{res}{space 2} .4252287{col 26}{space 2} .3685384{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.2973817{col 67}{space 3} 1.147839
{txt}{space 7}4594  {c |}{col 14}{res}{space 2}-.2577669{col 26}{space 2} .3595983{col 37}{space 1}   -0.72{col 46}{space 3}0.474{col 54}{space 4} -.962848{col 67}{space 3} .4473141
{txt}{space 7}4595  {c |}{col 14}{res}{space 2}  1.36615{col 26}{space 2} .5049185{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .3761327{col 67}{space 3} 2.356167
{txt}{space 7}4596  {c |}{col 14}{res}{space 2} .5215421{col 26}{space 2} .3409424{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.1469594{col 67}{space 3} 1.190044
{txt}{space 7}4597  {c |}{col 14}{res}{space 2} .2955173{col 26}{space 2} .3760244{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}-.4417712{col 67}{space 3} 1.032806
{txt}{space 7}4598  {c |}{col 14}{res}{space 2}-.1798744{col 26}{space 2} .4461922{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-1.054744{col 67}{space 3} .6949953
{txt}{space 7}4599  {c |}{col 14}{res}{space 2} .7887892{col 26}{space 2} .4451728{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.0840818{col 67}{space 3}  1.66166
{txt}{space 7}4600  {c |}{col 14}{res}{space 2} .2912275{col 26}{space 2} .6491186{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-.9815296{col 67}{space 3} 1.563985
{txt}{space 7}4601  {c |}{col 14}{res}{space 2}-.5013713{col 26}{space 2} .3972188{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-1.280217{col 67}{space 3}  .277474
{txt}{space 7}4602  {c |}{col 14}{res}{space 2} .3895111{col 26}{space 2} .6682522{col 37}{space 1}    0.58{col 46}{space 3}0.560{col 54}{space 4} -.920762{col 67}{space 3} 1.699784
{txt}{space 7}4603  {c |}{col 14}{res}{space 2} 1.156036{col 26}{space 2} .3654028{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .4395741{col 67}{space 3} 1.872498
{txt}{space 7}4605  {c |}{col 14}{res}{space 2}-.1723127{col 26}{space 2} .3946226{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4}-.9460675{col 67}{space 3} .6014422
{txt}{space 7}4606  {c |}{col 14}{res}{space 2} .3300259{col 26}{space 2}  .648579{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4} -.941673{col 67}{space 3} 1.601725
{txt}{space 7}4607  {c |}{col 14}{res}{space 2}-.5686131{col 26}{space 2} .6485802{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-1.840314{col 67}{space 3} .7030882
{txt}{space 7}4608  {c |}{col 14}{res}{space 2} .1230372{col 26}{space 2} .6519611{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-1.155293{col 67}{space 3} 1.401368
{txt}{space 7}4611  {c |}{col 14}{res}{space 2}-.0577211{col 26}{space 2} .4135224{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.8685338{col 67}{space 3} .7530915
{txt}{space 7}4612  {c |}{col 14}{res}{space 2} .3285003{col 26}{space 2} .4334727{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-.5214297{col 67}{space 3}  1.17843
{txt}{space 7}4613  {c |}{col 14}{res}{space 2} .5924465{col 26}{space 2} .4470976{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.2841986{col 67}{space 3} 1.469092
{txt}{space 7}4615  {c |}{col 14}{res}{space 2}-.0248007{col 26}{space 2} .4456784{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-.8986631{col 67}{space 3} .8490616
{txt}{space 7}4616  {c |}{col 14}{res}{space 2} .8214524{col 26}{space 2} .5047742{col 37}{space 1}    1.63{col 46}{space 3}0.104{col 54}{space 4}-.1682819{col 67}{space 3} 1.811187
{txt}{space 7}4617  {c |}{col 14}{res}{space 2} .9272667{col 26}{space 2} .4441479{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4} .0564052{col 67}{space 3} 1.798128
{txt}{space 7}4618  {c |}{col 14}{res}{space 2} 1.058775{col 26}{space 2} .4445059{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .1872112{col 67}{space 3} 1.930338
{txt}{space 7}4619  {c |}{col 14}{res}{space 2} 1.042387{col 26}{space 2} .5234634{col 37}{space 1}    1.99{col 46}{space 3}0.047{col 54}{space 4} .0160084{col 67}{space 3} 2.068766
{txt}{space 7}4620  {c |}{col 14}{res}{space 2}  .463313{col 26}{space 2} .3596432{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.2418561{col 67}{space 3} 1.168482
{txt}{space 7}4621  {c |}{col 14}{res}{space 2} .1152289{col 26}{space 2} .3812975{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.6323987{col 67}{space 3} .8628566
{txt}{space 7}4623  {c |}{col 14}{res}{space 2} .7345975{col 26}{space 2}  .647465{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.5349173{col 67}{space 3} 2.004112
{txt}{space 7}4625  {c |}{col 14}{res}{space 2}   1.6348{col 26}{space 2}  .442779{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} .7666229{col 67}{space 3} 2.502977
{txt}{space 7}4626  {c |}{col 14}{res}{space 2} .7485084{col 26}{space 2} .4251671{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0851365{col 67}{space 3} 1.582153
{txt}{space 7}4627  {c |}{col 14}{res}{space 2}-.4892956{col 26}{space 2} .4906559{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-1.451347{col 67}{space 3} .4727563
{txt}{space 7}4628  {c |}{col 14}{res}{space 2} .1442655{col 26}{space 2} .4331252{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-.7049831{col 67}{space 3} .9935142
{txt}{space 7}4629  {c |}{col 14}{res}{space 2} .6669859{col 26}{space 2} .3843636{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0866538{col 67}{space 3} 1.420626
{txt}{space 7}4630  {c |}{col 14}{res}{space 2} 1.202495{col 26}{space 2} .3400803{col 37}{space 1}    3.54{col 46}{space 3}0.000{col 54}{space 4} .5356836{col 67}{space 3} 1.869306
{txt}{space 7}4631  {c |}{col 14}{res}{space 2} .8595064{col 26}{space 2} .3433968{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .1861924{col 67}{space 3}  1.53282
{txt}{space 7}4633  {c |}{col 14}{res}{space 2} .1271031{col 26}{space 2} .4178335{col 37}{space 1}    0.30{col 46}{space 3}0.761{col 54}{space 4}-.6921625{col 67}{space 3} .9463688
{txt}{space 7}4634  {c |}{col 14}{res}{space 2}-.3461253{col 26}{space 2}  .427861{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-1.185052{col 67}{space 3} .4928016
{txt}{space 7}4635  {c |}{col 14}{res}{space 2} .6219332{col 26}{space 2} .5059144{col 37}{space 1}    1.23{col 46}{space 3}0.219{col 54}{space 4}-.3700367{col 67}{space 3} 1.613903
{txt}{space 7}4636  {c |}{col 14}{res}{space 2} 1.336863{col 26}{space 2}  .342029{col 37}{space 1}    3.91{col 46}{space 3}0.000{col 54}{space 4} .6662311{col 67}{space 3} 2.007495
{txt}{space 7}4637  {c |}{col 14}{res}{space 2}-.4259393{col 26}{space 2} .3750329{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 54}{space 4}-1.161284{col 67}{space 3} .3094051
{txt}{space 7}4638  {c |}{col 14}{res}{space 2} .3308181{col 26}{space 2} .3681873{col 37}{space 1}    0.90{col 46}{space 3}0.369{col 54}{space 4}-.3911037{col 67}{space 3}  1.05274
{txt}{space 7}4639  {c |}{col 14}{res}{space 2} .1868213{col 26}{space 2} .3551876{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4}-.5096117{col 67}{space 3} .8832542
{txt}{space 7}4640  {c |}{col 14}{res}{space 2} .4858727{col 26}{space 2} .4143758{col 37}{space 1}    1.17{col 46}{space 3}0.241{col 54}{space 4}-.3266131{col 67}{space 3} 1.298359
{txt}{space 7}4641  {c |}{col 14}{res}{space 2} .4903306{col 26}{space 2} .3416108{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.1794816{col 67}{space 3} 1.160143
{txt}{space 7}4642  {c |}{col 14}{res}{space 2}  1.21395{col 26}{space 2} .6478408{col 37}{space 1}    1.87{col 46}{space 3}0.061{col 54}{space 4} -.056302{col 67}{space 3} 2.484201
{txt}{space 7}4643  {c |}{col 14}{res}{space 2}-.2737087{col 26}{space 2} .3624826{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 54}{space 4}-.9844451{col 67}{space 3} .4370278
{txt}{space 7}4644  {c |}{col 14}{res}{space 2} 1.144032{col 26}{space 2} .3615377{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .4351486{col 67}{space 3} 1.852916
{txt}{space 7}4645  {c |}{col 14}{res}{space 2}-.2642631{col 26}{space 2} .4297694{col 37}{space 1}   -0.61{col 46}{space 3}0.539{col 54}{space 4}-1.106932{col 67}{space 3} .5784056
{txt}{space 7}4646  {c |}{col 14}{res}{space 2} 1.018454{col 26}{space 2} .3416441{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4} .3485769{col 67}{space 3} 1.688332
{txt}{space 7}4647  {c |}{col 14}{res}{space 2} .7527649{col 26}{space 2} .3899591{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4} -.011846{col 67}{space 3} 1.517376
{txt}{space 7}4648  {c |}{col 14}{res}{space 2} .9186377{col 26}{space 2} .4500883{col 37}{space 1}    2.04{col 46}{space 3}0.041{col 54}{space 4} .0361287{col 67}{space 3} 1.801147
{txt}{space 7}4649  {c |}{col 14}{res}{space 2} 1.156052{col 26}{space 2} .3894098{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} .3925182{col 67}{space 3} 1.919586
{txt}{space 7}4650  {c |}{col 14}{res}{space 2} .2637442{col 26}{space 2} .4098054{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.5397803{col 67}{space 3} 1.067269
{txt}{space 7}4651  {c |}{col 14}{res}{space 2} .1102709{col 26}{space 2} .3436978{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-.5636334{col 67}{space 3} .7841751
{txt}{space 7}4653  {c |}{col 14}{res}{space 2} .8170417{col 26}{space 2} .3453037{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} .1399886{col 67}{space 3} 1.494095
{txt}{space 7}4654  {c |}{col 14}{res}{space 2} .3315362{col 26}{space 2} .3516716{col 37}{space 1}    0.94{col 46}{space 3}0.346{col 54}{space 4}-.3580027{col 67}{space 3} 1.021075
{txt}{space 7}4655  {c |}{col 14}{res}{space 2}  1.65347{col 26}{space 2} .5032119{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .6667987{col 67}{space 3} 2.640141
{txt}{space 7}4657  {c |}{col 14}{res}{space 2} .8999413{col 26}{space 2} .3751924{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} .1642842{col 67}{space 3} 1.635598
{txt}{space 7}4658  {c |}{col 14}{res}{space 2} 1.336617{col 26}{space 2} .3944576{col 37}{space 1}    3.39{col 46}{space 3}0.001{col 54}{space 4}  .563186{col 67}{space 3} 2.110049
{txt}{space 7}4659  {c |}{col 14}{res}{space 2} .7153989{col 26}{space 2} .5035695{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.2719731{col 67}{space 3} 1.702771
{txt}{space 7}4660  {c |}{col 14}{res}{space 2}   1.3811{col 26}{space 2} .4435821{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4}  .511348{col 67}{space 3} 2.250852
{txt}{space 7}4661  {c |}{col 14}{res}{space 2} 1.917201{col 26}{space 2} .5021444{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} .9326233{col 67}{space 3} 2.901779
{txt}{space 7}4662  {c |}{col 14}{res}{space 2} .8253321{col 26}{space 2} .4429647{col 37}{space 1}    1.86{col 46}{space 3}0.063{col 54}{space 4}-.0432093{col 67}{space 3} 1.693874
{txt}{space 7}4663  {c |}{col 14}{res}{space 2} 1.192817{col 26}{space 2} .3603427{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .4862759{col 67}{space 3} 1.899357
{txt}{space 7}4664  {c |}{col 14}{res}{space 2}-.0722882{col 26}{space 2} .6532525{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}-1.353151{col 67}{space 3} 1.208574
{txt}{space 7}4665  {c |}{col 14}{res}{space 2} .5269843{col 26}{space 2} .4332674{col 37}{space 1}    1.22{col 46}{space 3}0.224{col 54}{space 4}-.3225432{col 67}{space 3} 1.376512
{txt}{space 7}4667  {c |}{col 14}{res}{space 2}-.4814903{col 26}{space 2} .5105799{col 37}{space 1}   -0.94{col 46}{space 3}0.346{col 54}{space 4}-1.482608{col 67}{space 3} .5196273
{txt}{space 7}4669  {c |}{col 14}{res}{space 2} .0686671{col 26}{space 2} .4050292{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.7254924{col 67}{space 3} .8628266
{txt}{space 7}4671  {c |}{col 14}{res}{space 2}-.0736061{col 26}{space 2} .4007184{col 37}{space 1}   -0.18{col 46}{space 3}0.854{col 54}{space 4}-.8593134{col 67}{space 3} .7121011
{txt}{space 7}4672  {c |}{col 14}{res}{space 2} .8119027{col 26}{space 2} .3594342{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} .1071434{col 67}{space 3} 1.516662
{txt}{space 7}4673  {c |}{col 14}{res}{space 2} .6112511{col 26}{space 2}  .503663{col 37}{space 1}    1.21{col 46}{space 3}0.225{col 54}{space 4}-.3763044{col 67}{space 3} 1.598807
{txt}{space 7}4674  {c |}{col 14}{res}{space 2} 1.032588{col 26}{space 2}  .401248{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .2458425{col 67}{space 3} 1.819334
{txt}{space 7}4675  {c |}{col 14}{res}{space 2} .4686632{col 26}{space 2} .3600692{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}-.2373412{col 67}{space 3} 1.174668
{txt}{space 7}4676  {c |}{col 14}{res}{space 2} .1974296{col 26}{space 2} .6478175{col 37}{space 1}    0.30{col 46}{space 3}0.761{col 54}{space 4}-1.072776{col 67}{space 3} 1.467636
{txt}{space 7}4677  {c |}{col 14}{res}{space 2}   1.1225{col 26}{space 2}   .35241{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .4315136{col 67}{space 3} 1.813487
{txt}{space 7}4678  {c |}{col 14}{res}{space 2}-.3119483{col 26}{space 2} .3923106{col 37}{space 1}   -0.80{col 46}{space 3}0.427{col 54}{space 4} -1.08117{col 67}{space 3} .4572734
{txt}{space 7}4679  {c |}{col 14}{res}{space 2} .2418234{col 26}{space 2} .3563393{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4}-.4568676{col 67}{space 3} .9405144
{txt}{space 7}4680  {c |}{col 14}{res}{space 2} .1890769{col 26}{space 2} .3776018{col 37}{space 1}    0.50{col 46}{space 3}0.617{col 54}{space 4}-.5513044{col 67}{space 3} .9294582
{txt}{space 7}4681  {c |}{col 14}{res}{space 2} .2099568{col 26}{space 2} .3464156{col 37}{space 1}    0.61{col 46}{space 3}0.545{col 54}{space 4}-.4692764{col 67}{space 3} .8891899
{txt}{space 7}4682  {c |}{col 14}{res}{space 2}-.2064957{col 26}{space 2} .4737392{col 37}{space 1}   -0.44{col 46}{space 3}0.663{col 54}{space 4}-1.135378{col 67}{space 3} .7223867
{txt}{space 7}4683  {c |}{col 14}{res}{space 2}-.0932187{col 26}{space 2} .3627468{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-.8044732{col 67}{space 3} .6180359
{txt}{space 7}4684  {c |}{col 14}{res}{space 2} .5896553{col 26}{space 2} .3794673{col 37}{space 1}    1.55{col 46}{space 3}0.120{col 54}{space 4}-.1543838{col 67}{space 3} 1.333694
{txt}{space 7}4685  {c |}{col 14}{res}{space 2} .2778774{col 26}{space 2} .3813798{col 37}{space 1}    0.73{col 46}{space 3}0.466{col 54}{space 4}-.4699116{col 67}{space 3} 1.025666
{txt}{space 7}4686  {c |}{col 14}{res}{space 2}-.2486953{col 26}{space 2}  .551588{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-1.330219{col 67}{space 3} .8328289
{txt}{space 7}4687  {c |}{col 14}{res}{space 2}  .630501{col 26}{space 2} .3590496{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0735043{col 67}{space 3} 1.334506
{txt}{space 7}4688  {c |}{col 14}{res}{space 2}-.5264445{col 26}{space 2} .3814705{col 37}{space 1}   -1.38{col 46}{space 3}0.168{col 54}{space 4}-1.274411{col 67}{space 3} .2215223
{txt}{space 7}4689  {c |}{col 14}{res}{space 2} .0870974{col 26}{space 2} .3565594{col 37}{space 1}    0.24{col 46}{space 3}0.807{col 54}{space 4}-.6120252{col 67}{space 3}   .78622
{txt}{space 7}4690  {c |}{col 14}{res}{space 2} .2683077{col 26}{space 2} .3897408{col 37}{space 1}    0.69{col 46}{space 3}0.491{col 54}{space 4}-.4958753{col 67}{space 3} 1.032491
{txt}{space 7}4691  {c |}{col 14}{res}{space 2} .9925423{col 26}{space 2} .3622718{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .2822192{col 67}{space 3} 1.702865
{txt}{space 7}4692  {c |}{col 14}{res}{space 2}-.2966529{col 26}{space 2} .3921404{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-1.065541{col 67}{space 3}  .472235
{txt}{space 7}4693  {c |}{col 14}{res}{space 2} .3408746{col 26}{space 2} .3668551{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-.3784352{col 67}{space 3} 1.060184
{txt}{space 7}4694  {c |}{col 14}{res}{space 2} .2292586{col 26}{space 2}  .384599{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 54}{space 4}-.5248425{col 67}{space 3} .9833596
{txt}{space 7}4695  {c |}{col 14}{res}{space 2} .1380734{col 26}{space 2} .3718644{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.5910585{col 67}{space 3} .8672052
{txt}{space 7}4696  {c |}{col 14}{res}{space 2}-.1701284{col 26}{space 2} .4008307{col 37}{space 1}   -0.42{col 46}{space 3}0.671{col 54}{space 4}-.9560559{col 67}{space 3}  .615799
{txt}{space 7}4697  {c |}{col 14}{res}{space 2}-.7116781{col 26}{space 2} .4653149{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4}-1.624043{col 67}{space 3} .2006864
{txt}{space 7}4698  {c |}{col 14}{res}{space 2}-.0470654{col 26}{space 2} .3644349{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-.7616297{col 67}{space 3}  .667499
{txt}{space 7}4699  {c |}{col 14}{res}{space 2} .2869502{col 26}{space 2} .3658071{col 37}{space 1}    0.78{col 46}{space 3}0.433{col 54}{space 4}-.4303048{col 67}{space 3} 1.004205
{txt}{space 7}4700  {c |}{col 14}{res}{space 2}-.2270328{col 26}{space 2} .3748178{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-.9619555{col 67}{space 3} .5078898
{txt}{space 7}4701  {c |}{col 14}{res}{space 2} .0367034{col 26}{space 2} .6549491{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-1.247486{col 67}{space 3} 1.320893
{txt}{space 7}4702  {c |}{col 14}{res}{space 2}-.7036028{col 26}{space 2} .3874591{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-1.463312{col 67}{space 3} .0561062
{txt}{space 7}4703  {c |}{col 14}{res}{space 2} .5261264{col 26}{space 2} .3794348{col 37}{space 1}    1.39{col 46}{space 3}0.166{col 54}{space 4}-.2178492{col 67}{space 3} 1.270102
{txt}{space 7}4704  {c |}{col 14}{res}{space 2} .3643145{col 26}{space 2} .4038911{col 37}{space 1}    0.90{col 46}{space 3}0.367{col 54}{space 4}-.4276135{col 67}{space 3} 1.156242
{txt}{space 7}4705  {c |}{col 14}{res}{space 2} 1.171705{col 26}{space 2} .5245685{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .1431596{col 67}{space 3} 2.200251
{txt}{space 7}4706  {c |}{col 14}{res}{space 2}-.0500993{col 26}{space 2} .4157221{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4} -.865225{col 67}{space 3} .7650264
{txt}{space 7}4707  {c |}{col 14}{res}{space 2} .5547726{col 26}{space 2} .5054976{col 37}{space 1}    1.10{col 46}{space 3}0.273{col 54}{space 4}-.4363801{col 67}{space 3} 1.545925
{txt}{space 7}4708  {c |}{col 14}{res}{space 2} .9597746{col 26}{space 2} .4117849{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} .1523688{col 67}{space 3}  1.76718
{txt}{space 7}4710  {c |}{col 14}{res}{space 2} .9817105{col 26}{space 2}  .375562{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} .2453285{col 67}{space 3} 1.718092
{txt}{space 7}4711  {c |}{col 14}{res}{space 2} .5461698{col 26}{space 2} .3753751{col 37}{space 1}    1.45{col 46}{space 3}0.146{col 54}{space 4}-.1898456{col 67}{space 3} 1.282185
{txt}{space 7}4712  {c |}{col 14}{res}{space 2}  .190461{col 26}{space 2} .3440919{col 37}{space 1}    0.55{col 46}{space 3}0.580{col 54}{space 4}-.4842159{col 67}{space 3}  .865138
{txt}{space 7}4713  {c |}{col 14}{res}{space 2} .3336367{col 26}{space 2} .3545769{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.3615988{col 67}{space 3} 1.028872
{txt}{space 7}4715  {c |}{col 14}{res}{space 2} .2219928{col 26}{space 2} .3522764{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4} -.468732{col 67}{space 3} .9127176
{txt}{space 7}4716  {c |}{col 14}{res}{space 2} .2617187{col 26}{space 2} .3828102{col 37}{space 1}    0.68{col 46}{space 3}0.494{col 54}{space 4}-.4888752{col 67}{space 3} 1.012312
{txt}{space 7}4717  {c |}{col 14}{res}{space 2} 1.973234{col 26}{space 2} .6482456{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} .7021882{col 67}{space 3} 3.244279
{txt}{space 7}4718  {c |}{col 14}{res}{space 2} .3048073{col 26}{space 2}   .38997{col 37}{space 1}    0.78{col 46}{space 3}0.435{col 54}{space 4} -.459825{col 67}{space 3}  1.06944
{txt}{space 7}4719  {c |}{col 14}{res}{space 2}-.1624687{col 26}{space 2} .3666816{col 37}{space 1}   -0.44{col 46}{space 3}0.658{col 54}{space 4}-.8814384{col 67}{space 3} .5565011
{txt}{space 7}4720  {c |}{col 14}{res}{space 2} .9238389{col 26}{space 2} .3852314{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} .1684979{col 67}{space 3}  1.67918
{txt}{space 7}4721  {c |}{col 14}{res}{space 2} .4982115{col 26}{space 2} .4126775{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4}-.3109444{col 67}{space 3} 1.307367
{txt}{space 7}4722  {c |}{col 14}{res}{space 2} 1.082561{col 26}{space 2} .4123489{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4} .2740493{col 67}{space 3} 1.891073
{txt}{space 7}4723  {c |}{col 14}{res}{space 2} 1.333167{col 26}{space 2} .3892471{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4}  .569952{col 67}{space 3} 2.096382
{txt}{space 7}4725  {c |}{col 14}{res}{space 2} 1.027686{col 26}{space 2} .3826495{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 54}{space 4} .2774072{col 67}{space 3} 1.777965
{txt}{space 7}4726  {c |}{col 14}{res}{space 2}-.5674896{col 26}{space 2} .6614222{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-1.864371{col 67}{space 3} .7293917
{txt}{space 7}4727  {c |}{col 14}{res}{space 2} .6581392{col 26}{space 2} .3676723{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-.0627729{col 67}{space 3} 1.379051
{txt}{space 7}4728  {c |}{col 14}{res}{space 2} .2483854{col 26}{space 2} .4530627{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 54}{space 4}-.6399558{col 67}{space 3} 1.136727
{txt}{space 7}4729  {c |}{col 14}{res}{space 2} .2407919{col 26}{space 2} .3774302{col 37}{space 1}    0.64{col 46}{space 3}0.524{col 54}{space 4}-.4992531{col 67}{space 3} .9808369
{txt}{space 7}4730  {c |}{col 14}{res}{space 2} .2446071{col 26}{space 2} .5023666{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.7404064{col 67}{space 3} 1.229621
{txt}{space 7}4731  {c |}{col 14}{res}{space 2} 1.316737{col 26}{space 2} .3752032{col 37}{space 1}    3.51{col 46}{space 3}0.000{col 54}{space 4} .5810588{col 67}{space 3} 2.052415
{txt}{space 7}4732  {c |}{col 14}{res}{space 2} .7413613{col 26}{space 2} .3576725{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0400562{col 67}{space 3} 1.442666
{txt}{space 7}4733  {c |}{col 14}{res}{space 2} .7099896{col 26}{space 2} .3568911{col 37}{space 1}    1.99{col 46}{space 3}0.047{col 54}{space 4} .0102167{col 67}{space 3} 1.409762
{txt}{space 7}4735  {c |}{col 14}{res}{space 2} .4374691{col 26}{space 2} .3749681{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4}-.2977483{col 67}{space 3} 1.172687
{txt}{space 7}4738  {c |}{col 14}{res}{space 2} 1.513905{col 26}{space 2} .4423953{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4} .6464803{col 67}{space 3}  2.38133
{txt}{space 7}4739  {c |}{col 14}{res}{space 2} .6578287{col 26}{space 2} .3788027{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0849074{col 67}{space 3} 1.400565
{txt}{space 7}4740  {c |}{col 14}{res}{space 2} .0617613{col 26}{space 2} .5042369{col 37}{space 1}    0.12{col 46}{space 3}0.903{col 54}{space 4}-.9269194{col 67}{space 3} 1.050442
{txt}{space 7}4742  {c |}{col 14}{res}{space 2} .8218786{col 26}{space 2} .7213166{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.5924403{col 67}{space 3} 2.236198
{txt}{space 7}4743  {c |}{col 14}{res}{space 2} .4318842{col 26}{space 2} .3567393{col 37}{space 1}    1.21{col 46}{space 3}0.226{col 54}{space 4}-.2675911{col 67}{space 3} 1.131359
{txt}{space 7}4744  {c |}{col 14}{res}{space 2} .7224561{col 26}{space 2} .3511612{col 37}{space 1}    2.06{col 46}{space 3}0.040{col 54}{space 4} .0339181{col 67}{space 3} 1.410994
{txt}{space 7}4745  {c |}{col 14}{res}{space 2} .9788152{col 26}{space 2}  .369628{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .2540685{col 67}{space 3} 1.703562
{txt}{space 7}4747  {c |}{col 14}{res}{space 2}  .281389{col 26}{space 2} .3580947{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4} -.420744{col 67}{space 3}  .983522
{txt}{space 7}4749  {c |}{col 14}{res}{space 2} .7161666{col 26}{space 2} .4115152{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0907103{col 67}{space 3} 1.523043
{txt}{space 7}4750  {c |}{col 14}{res}{space 2} 1.207269{col 26}{space 2} .3912443{col 37}{space 1}    3.09{col 46}{space 3}0.002{col 54}{space 4} .4401383{col 67}{space 3}   1.9744
{txt}{space 7}4751  {c |}{col 14}{res}{space 2} .9650124{col 26}{space 2} .3766985{col 37}{space 1}    2.56{col 46}{space 3}0.010{col 54}{space 4} .2264021{col 67}{space 3} 1.703623
{txt}{space 7}4752  {c |}{col 14}{res}{space 2} .2182788{col 26}{space 2} .3658054{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 54}{space 4}-.4989727{col 67}{space 3} .9355304
{txt}{space 7}4753  {c |}{col 14}{res}{space 2}-.0652565{col 26}{space 2} .3385232{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.7290148{col 67}{space 3} .5985017
{txt}{space 7}4754  {c |}{col 14}{res}{space 2} .3243095{col 26}{space 2} .5042223{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.6643427{col 67}{space 3} 1.312962
{txt}{space 7}4755  {c |}{col 14}{res}{space 2} .4041709{col 26}{space 2} .4165217{col 37}{space 1}    0.97{col 46}{space 3}0.332{col 54}{space 4}-.4125226{col 67}{space 3} 1.220864
{txt}{space 7}4756  {c |}{col 14}{res}{space 2} .1346611{col 26}{space 2} .3511192{col 37}{space 1}    0.38{col 46}{space 3}0.701{col 54}{space 4}-.5537947{col 67}{space 3} .8231168
{txt}{space 7}4758  {c |}{col 14}{res}{space 2} .6146537{col 26}{space 2} .4049874{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4}-.1794239{col 67}{space 3} 1.408731
{txt}{space 7}4759  {c |}{col 14}{res}{space 2} .0601845{col 26}{space 2} .4460886{col 37}{space 1}    0.13{col 46}{space 3}0.893{col 54}{space 4}-.8144822{col 67}{space 3} .9348511
{txt}{space 7}4760  {c |}{col 14}{res}{space 2} .6804748{col 26}{space 2} .4853532{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4}-.2711797{col 67}{space 3} 1.632129
{txt}{space 7}4761  {c |}{col 14}{res}{space 2} .3093788{col 26}{space 2} .6505391{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-.9661636{col 67}{space 3} 1.584921
{txt}{space 7}4762  {c |}{col 14}{res}{space 2} .2187799{col 26}{space 2} .3695766{col 37}{space 1}    0.59{col 46}{space 3}0.554{col 54}{space 4} -.505866{col 67}{space 3} .9434258
{txt}{space 7}4763  {c |}{col 14}{res}{space 2} .2263256{col 26}{space 2} .3657299{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.4907781{col 67}{space 3} .9434292
{txt}{space 7}4764  {c |}{col 14}{res}{space 2} .1572422{col 26}{space 2} .3900754{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-.6075967{col 67}{space 3} .9220811
{txt}{space 7}4765  {c |}{col 14}{res}{space 2} 1.119117{col 26}{space 2} .3911988{col 37}{space 1}    2.86{col 46}{space 3}0.004{col 54}{space 4} .3520748{col 67}{space 3} 1.886158
{txt}{space 7}4766  {c |}{col 14}{res}{space 2} .6235883{col 26}{space 2} .4181408{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4}-.1962798{col 67}{space 3} 1.443456
{txt}{space 7}4767  {c |}{col 14}{res}{space 2} .5526086{col 26}{space 2}  .367007{col 37}{space 1}    1.51{col 46}{space 3}0.132{col 54}{space 4}-.1669991{col 67}{space 3} 1.272216
{txt}{space 7}4768  {c |}{col 14}{res}{space 2} .0677998{col 26}{space 2} .3981583{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.7128876{col 67}{space 3} .8484872
{txt}{space 7}4769  {c |}{col 14}{res}{space 2} 1.232931{col 26}{space 2} .3589073{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .5292051{col 67}{space 3} 1.936658
{txt}{space 7}4770  {c |}{col 14}{res}{space 2}-.0284788{col 26}{space 2} .4438967{col 37}{space 1}   -0.06{col 46}{space 3}0.949{col 54}{space 4}-.8988476{col 67}{space 3} .8418899
{txt}{space 7}4771  {c |}{col 14}{res}{space 2} .4505089{col 26}{space 2} .4073746{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4}-.3482495{col 67}{space 3} 1.249267
{txt}{space 7}4772  {c |}{col 14}{res}{space 2} -.401927{col 26}{space 2} .4211666{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-1.227728{col 67}{space 3}  .423874
{txt}{space 7}4773  {c |}{col 14}{res}{space 2} .1335566{col 26}{space 2} .3804442{col 37}{space 1}    0.35{col 46}{space 3}0.726{col 54}{space 4}-.6123981{col 67}{space 3} .8795112
{txt}{space 7}4774  {c |}{col 14}{res}{space 2} .9050311{col 26}{space 2} .3549474{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .2090693{col 67}{space 3} 1.600993
{txt}{space 7}4775  {c |}{col 14}{res}{space 2} .0518167{col 26}{space 2} .3533329{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-.6409795{col 67}{space 3} .7446129
{txt}{space 7}4776  {c |}{col 14}{res}{space 2} .1402611{col 26}{space 2} .3749033{col 37}{space 1}    0.37{col 46}{space 3}0.708{col 54}{space 4}-.5948292{col 67}{space 3} .8753515
{txt}{space 7}4777  {c |}{col 14}{res}{space 2} .4094433{col 26}{space 2} .4107106{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4} -.395856{col 67}{space 3} 1.214743
{txt}{space 7}4778  {c |}{col 14}{res}{space 2} .5398308{col 26}{space 2} .6567201{col 37}{space 1}    0.82{col 46}{space 3}0.411{col 54}{space 4}-.7478308{col 67}{space 3} 1.827492
{txt}{space 7}4779  {c |}{col 14}{res}{space 2}-.0682256{col 26}{space 2} .4122268{col 37}{space 1}   -0.17{col 46}{space 3}0.869{col 54}{space 4}-.8764979{col 67}{space 3} .7400467
{txt}{space 7}4780  {c |}{col 14}{res}{space 2} .1639019{col 26}{space 2} .4495032{col 37}{space 1}    0.36{col 46}{space 3}0.715{col 54}{space 4}-.7174599{col 67}{space 3} 1.045264
{txt}{space 7}4781  {c |}{col 14}{res}{space 2} .5088071{col 26}{space 2} .3810634{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 54}{space 4}-.2383616{col 67}{space 3} 1.255976
{txt}{space 7}4782  {c |}{col 14}{res}{space 2} .8185104{col 26}{space 2} .3761887{col 37}{space 1}    2.18{col 46}{space 3}0.030{col 54}{space 4} .0808998{col 67}{space 3} 1.556121
{txt}{space 7}4783  {c |}{col 14}{res}{space 2} .4716896{col 26}{space 2} .3716406{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.2570034{col 67}{space 3} 1.200383
{txt}{space 7}4784  {c |}{col 14}{res}{space 2}-.1215985{col 26}{space 2} .5105504{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-1.122658{col 67}{space 3} .8794613
{txt}{space 7}4785  {c |}{col 14}{res}{space 2}  .319595{col 26}{space 2} .5136972{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4} -.687635{col 67}{space 3} 1.326825
{txt}{space 7}4786  {c |}{col 14}{res}{space 2} .1842163{col 26}{space 2} .3758505{col 37}{space 1}    0.49{col 46}{space 3}0.624{col 54}{space 4}-.5527312{col 67}{space 3} .9211639
{txt}{space 7}4787  {c |}{col 14}{res}{space 2} .1300502{col 26}{space 2} .4488551{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-.7500409{col 67}{space 3} 1.010141
{txt}{space 7}4788  {c |}{col 14}{res}{space 2}-.0617049{col 26}{space 2} .3772142{col 37}{space 1}   -0.16{col 46}{space 3}0.870{col 54}{space 4}-.8013263{col 67}{space 3} .6779164
{txt}{space 7}4789  {c |}{col 14}{res}{space 2}-.3769032{col 26}{space 2} .4422436{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-1.244031{col 67}{space 3} .4902244
{txt}{space 7}4790  {c |}{col 14}{res}{space 2} .3403246{col 26}{space 2} .4149076{col 37}{space 1}    0.82{col 46}{space 3}0.412{col 54}{space 4}-.4732041{col 67}{space 3} 1.153853
{txt}{space 7}4791  {c |}{col 14}{res}{space 2}-.2149332{col 26}{space 2} .3879389{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-.9755831{col 67}{space 3} .5457167
{txt}{space 7}4792  {c |}{col 14}{res}{space 2} .1923949{col 26}{space 2} .3414386{col 37}{space 1}    0.56{col 46}{space 3}0.573{col 54}{space 4}-.4770795{col 67}{space 3} .8618694
{txt}{space 7}4793  {c |}{col 14}{res}{space 2} .2552477{col 26}{space 2} .3895243{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-.5085108{col 67}{space 3} 1.019006
{txt}{space 7}4795  {c |}{col 14}{res}{space 2} .8920955{col 26}{space 2} .6532569{col 37}{space 1}    1.37{col 46}{space 3}0.172{col 54}{space 4}-.3887756{col 67}{space 3} 2.172967
{txt}{space 7}4796  {c |}{col 14}{res}{space 2}-.2693412{col 26}{space 2} .3447212{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4} -.945252{col 67}{space 3} .4065696
{txt}{space 7}4797  {c |}{col 14}{res}{space 2} .8439831{col 26}{space 2} .3528043{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .1522234{col 67}{space 3} 1.535743
{txt}{space 7}4798  {c |}{col 14}{res}{space 2} .4501457{col 26}{space 2} .3469722{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-.2301788{col 67}{space 3}  1.13047
{txt}{space 7}4799  {c |}{col 14}{res}{space 2} .5746742{col 26}{space 2} .3790217{col 37}{space 1}    1.52{col 46}{space 3}0.130{col 54}{space 4}-.1684913{col 67}{space 3}  1.31784
{txt}{space 7}4800  {c |}{col 14}{res}{space 2}-.1359998{col 26}{space 2} .3535995{col 37}{space 1}   -0.38{col 46}{space 3}0.701{col 54}{space 4}-.8293187{col 67}{space 3} .5573192
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.273476{col 26}{space 2}  .344773{col 37}{space 1}   12.40{col 46}{space 3}0.000{col 54}{space 4} 3.597464{col 67}{space 3} 4.949489
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}r; t=6.99 21:44:26

{com}. // Here see if we can hide the results while viewing
. 
. 
. * --- PREDICT & IMPUTE (DUAN'S SMEARING) ---
. predict resid, residuals
{txt}(5,952 missing values generated)
r; t=0.08 21:44:27

{com}. gen exp_resid = exp(resid)
{txt}(5,952 missing values generated)
r; t=0.00 21:44:27

{com}. summarize exp_resid

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}exp_resid {c |}{res}      3,648    1.161749    .8020576   .1278354   15.32851
{txt}r; t=0.00 21:44:27

{com}. local smearing_factor = r(mean)
{txt}r; t=0.00 21:44:27

{com}. 
. predict ln_rent_hat, xb
{txt}(5,732 missing values generated)
r; t=0.21 21:44:27

{com}. gen predicted_rent_annual = exp(ln_rent_hat) * `smearing_factor' * 12
{txt}(5,732 missing values generated)
r; t=0.00 21:44:27

{com}.                 
. gen final_rent_annual = .
{txt}(9,600 missing values generated)
r; t=0.00 21:44:27

{com}. gen actual_rent_annual = q02_18 * 12
{txt}(8,438 missing values generated)
r; t=0.00 21:44:27

{com}. 
. replace final_rent_annual = actual_rent_annual if is_renter == 1 & actual_rent_annual != .
{txt}(1,162 real changes made)
r; t=0.00 21:44:27

{com}. replace final_rent_annual = predicted_rent_annual if final_rent_annual == .             
{txt}(3,715 real changes made)
r; t=0.00 21:44:27

{com}.         
. * Add Utilities (Water, Garbage, Electricity, Fuel)
. 
. gen util_water = q02_23
{txt}(1 missing value generated)
r; t=0.00 21:44:27

{com}. replace util_water = 0 if util_water == .
{txt}(1 real change made)
r; t=0.00 21:44:27

{com}. gen util_garbage = q02_26 * 12
{txt}(7,381 missing values generated)
r; t=0.00 21:44:27

{com}. replace util_garbage = 0 if util_garbage == .
{txt}(7,381 real changes made)
r; t=0.00 21:44:27

{com}. gen util_elec = q02_30
{txt}r; t=0.01 21:44:27

{com}. replace util_elec = 0 if util_elec == .
{txt}(0 real changes made)
r; t=0.00 21:44:27

{com}. // Firewood is excluded because it is said so
. 
. 
. gen housing_aggregate_annual = final_rent_annual + util_water + util_garbage + util_elec
{txt}(4,723 missing values generated)
r; t=0.00 21:44:27

{com}. 
. collapse (sum) housing_aggregate_annual, by(psu_number hh_number)
{res}{txt}r; t=0.03 21:44:27

{com}. label var housing_aggregate_annual "Final Annual Housing Consumption"
{txt}r; t=0.00 21:44:27

{com}. 
. save "$data_tmp/agg_housing_final.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/1_data/4_tmp/agg_housing_final.dta{rm}
saved
{p_end}
r; t=0.02 21:44:27

{com}. 
. summarize housing_aggregate_annual, detail

              {txt}Final Annual Housing Consumption
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      9,600
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      9,600

{txt}50%    {res} 7624.287                      {txt}Mean          {res} 27466.69
                        {txt}Largest       Std. dev.     {res} 54863.77
{txt}75%    {res}  33849.6       846349.8
{txt}90%    {res}    72000         918800       {txt}Variance      {res} 3.01e+09
{txt}95%    {res} 115025.9       997257.4       {txt}Skewness      {res} 6.368996
{txt}99%    {res} 239735.1        1398082       {txt}Kurtosis      {res} 86.37534
{txt}r; t=0.01 21:44:27

{com}. 
{txt}end of do-file
r; t=12.07 21:44:27

{com}. do "$prep/4_food-cons.do"
{txt}
{com}. *------------------------------------------------------------------------------*
. *           Cleaning for food consumption in NLSS                                          *
. /*
> 
>         Author:                         Arpan and Kapil
>         Date created:           7th Feb 2026
>         Date updated:           8th Feb 2026
>         Last Updated by:        Arpan
> 
>         Notes:                          
>                         
>         Dependencies:           Run 0_master before
> 
> */
. 
. *------------------------------------------------------------------------------*
. * STEP 3.1: FOOD AWAY FROM HOME (SECTION 5 PART B)                             *
. *------------------------------------------------------------------------------*
. 
. use "$data_raw/S05B.dta", clear
{txt}(NLSS04_DICT)
r; t=0.01 21:44:27

{com}. 
. *Calculate total weekly expenditure per person
. 
. egen fah_weekly_indiv = rowtotal(q05_08_b q05_09_b q05_10_b q05_11_b q05_12_b q05_13_b q05_14_b q05_15)
{txt}r; t=0.07 21:44:27

{com}. 
. collapse (sum) fah_weekly = fah_weekly_indiv, by (psu_number hh_number)
{res}{txt}r; t=0.05 21:44:27

{com}. 
. *Annualize it
. gen fah_annual = fah_weekly * (365/7)
{txt}r; t=0.00 21:44:27

{com}. label var fah_weekly "Weekly Food Away From Home"
{txt}r; t=0.00 21:44:27

{com}. label var fah_annual "Annual Food Away From Home"
{txt}r; t=0.00 21:44:27

{com}. 
. tempfile fah_data
{txt}r; t=0.00 21:44:27

{com}. save `fah_data'
{txt}{p 0 4 2}
file {bf}
C:\Users\ARPANA~1\AppData\Local\Temp\ST_14a0_000001.tmp{rm}
saved
as .dta format
{p_end}
r; t=0.03 21:44:27

{com}. 
. summarize fah_annual, detail

                 {txt}Annual Food Away From Home
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      9,600
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      9,600

{txt}50%    {res}    16425                      {txt}Mean          {res} 40025.48
                        {txt}Largest       Std. dev.     {res} 77294.72
{txt}75%    {res} 46016.07        1238393
{txt}90%    {res} 101939.3        1332250       {txt}Variance      {res} 5.97e+09
{txt}95%    {res} 154733.9        1388304       {txt}Skewness      {res} 6.615594
{txt}99%    {res} 359003.6        1475643       {txt}Kurtosis      {res} 77.51314
{txt}r; t=0.01 21:44:27

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 3.2: FOOD AT HOME (SECTION 5A) - CLEANING & IMPUTATION                  *
. *------------------------------------------------------------------------------*
. use "$data_raw/S05.dta", clear
{txt}(NLSS04_DICT)
r; t=0.69 21:44:28

{com}. 
. merge m:1 psu_number hh_number using "$data_raw/poverty.dta", keepusing(domain ad_4 hhs_wt)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       1,305,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=1.09 21:44:29

{com}. keep if _merge == 3
{txt}(0 observations deleted)
r; t=0.07 21:44:29

{com}. drop _merge
{txt}r; t=0.00 21:44:29

{com}. 
. * Define Hierarchy Variables
. * We use 'domain' as the main stratum variable based on your file.
. gen national = 1
{txt}r; t=0.09 21:44:29

{com}. 
. gen conversion = 1
{txt}r; t=0.07 21:44:29

{com}. replace conversion = 0.001 if s05_unit == 1 // Grams -> Kg
{txt}(844,800 real changes made)
r; t=0.32 21:44:29

{com}. replace conversion = 0.001 if s05_unit == 2 // ML -> Litre
{txt}(115,200 real changes made)
r; t=0.14 21:44:30

{com}. replace conversion = 1.000 if s05_unit == 3 // Number -> Piece
{txt}(0 real changes made)
r; t=0.16 21:44:30

{com}. 
. * Convert Quantities
. gen qty_mkt_std  = q05_04 * conversion
{txt}(1,041,402 missing values generated)
r; t=0.14 21:44:30

{com}. gen qty_home_std = q05_03 * conversion
{txt}(1,083,249 missing values generated)
r; t=0.20 21:44:30

{com}. gen qty_kind_std = q05_05 * conversion
{txt}(1,041,416 missing values generated)
r; t=0.15 21:44:30

{com}. 
. 
. *------------------------------------------------------------------------------*
. * 3. CALCULATE UNIT VALUES (PRICE PER STANDARD UNIT)                           *
. *------------------------------------------------------------------------------*
. gen uv = q05_04_b / qty_mkt_std
{txt}(1,107,837 missing values generated)
r; t=0.42 21:44:31

{com}. replace uv = . if qty_mkt_std <= 0 | q05_04_b <= 0   //removing infinite or zero price
{txt}(0 real changes made)
r; t=0.23 21:44:31

{com}. 
. *------------------------------------------------------------------------------*
. * 4. DETECT OUTLIERS (Z-SCORE METHOD)                                          *
. *------------------------------------------------------------------------------*
. gen ln_uv = ln(uv)
{txt}(1,107,837 missing values generated)
r; t=0.15 21:44:31

{com}. 
. * Calculate Mean and SD of Price *by Item*
. bysort food_code: egen mean_ln_uv = mean(ln_uv)
{txt}(355,200 missing values generated)
r; t=2.01 21:44:33

{com}. bysort food_code: egen sd_ln_uv = sd(ln_uv)
{txt}(374,400 missing values generated)
r; t=1.76 21:44:35

{com}. 
. * Z-Score > 2.5 is an outlier
. gen z_score = (ln_uv - mean_ln_uv) / sd_ln_uv
{txt}(1,107,839 missing values generated)
r; t=0.45 21:44:36

{com}. gen is_outlier = (abs(z_score) > 2.5) & (uv != .)
{txt}r; t=0.53 21:44:36

{com}. 
. * Set Outlier Prices to Missing
. replace uv = . if is_outlier == 1
{txt}(4,642 real changes made, 4,642 to missing)
r; t=0.11 21:44:36

{com}. 
. *------------------------------------------------------------------------------*
. * 5. CALCULATE MEDIAN PRICES (HIERARCHY)                                       *
. *------------------------------------------------------------------------------*
. * Hierarchy: PSU -> Domain -> Urban/Rural -> National
. 
. * A. PSU Median (Weighted by hhs_wt)
. * (We use 'count' to ensure min 9 observations rule)
. bysort psu_number food_code: egen count_psu = count(uv)
{txt}r; t=1.55 21:44:38

{com}. bysort psu_number food_code: egen median_psu = median(uv) 
{txt}(811,680 missing values generated)
r; t=1.93 21:44:40

{com}. replace median_psu = . if count_psu < 9 
{txt}(402,852 real changes made, 402,852 to missing)
r; t=0.27 21:44:40

{com}. 
. * B. Domain Median
. bysort domain food_code: egen median_domain = median(uv)
{txt}(414,396 missing values generated)
r; t=3.03 21:44:43

{com}. 
. * C. Urban/Rural Median (ad_4)
. bysort ad_4 food_code: egen median_ur = median(uv)
{txt}(375,936 missing values generated)
r; t=3.67 21:44:47

{com}. 
. * D. National Median
. bysort food_code: egen median_nat = median(uv)
{txt}(374,400 missing values generated)
r; t=3.65 21:44:50

{com}. 
. * --- ASSIGN FINAL PRICE ---
. gen final_price = .
{txt}(1,305,600 missing values generated)
r; t=0.22 21:44:51

{com}. replace final_price = median_psu
{txt}(91,068 real changes made)
r; t=0.33 21:44:51

{com}. replace final_price = median_domain if final_price == .
{txt}(800,136 real changes made)
r; t=0.43 21:44:51

{com}. replace final_price = median_ur     if final_price == .
{txt}(38,460 real changes made)
r; t=0.28 21:44:52

{com}. replace final_price = median_nat    if final_price == .
{txt}(1,536 real changes made)
r; t=0.31 21:44:52

{com}. 
. * Fallback: If still missing, use original if valid
. replace final_price = uv if final_price == . & uv != .
{txt}(0 real changes made)
r; t=0.34 21:44:52

{com}. 
. *------------------------------------------------------------------------------*
. * 6. CALCULATE FINAL CONSUMPTION VALUES                                        *
. *------------------------------------------------------------------------------*
. * Reprice EVERYTHING using the median price (Methodology Requirement)
. 
. gen val_mkt_final  = qty_mkt_std * final_price
{txt}(1,041,412 missing values generated)
r; t=0.32 21:44:53

{com}. gen val_home_final = qty_home_std * final_price
{txt}(1,083,288 missing values generated)
r; t=0.28 21:44:53

{com}. gen val_kind_final = qty_kind_std * final_price
{txt}(1,041,422 missing values generated)
r; t=0.32 21:44:53

{com}. 
. * Sum Components (Weekly)
. egen food_weekly_total = rowtotal(val_mkt_final val_home_final val_kind_final)
{txt}r; t=1.29 21:44:54

{com}. 
. *------------------------------------------------------------------------------*
. * 7. AGGREGATE TO HOUSEHOLD LEVEL & ANNUALIZE                                  *
. *------------------------------------------------------------------------------*
. collapse (sum) food_weekly_total, by(psu_number hh_number)
{res}{txt}r; t=2.03 21:44:57

{com}. 
. * Annualize (Weeks * 52.14)
. gen food_at_home_annual = food_weekly_total * (365/7)
{txt}r; t=0.00 21:44:57

{com}. label var food_at_home_annual "Annual Food Consumption (At Home)"
{txt}r; t=0.00 21:44:57

{com}. 
. *------------------------------------------------------------------------------*
. * 8. MERGE WITH FOOD AWAY FROM HOME & SAVE                                     *
. *------------------------------------------------------------------------------*
. * Ensure you have run the FAH code and saved `fah_data` or a tempfile
. merge 1:1 psu_number hh_number using `fah_data'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.02 21:44:57

{com}. drop if _merge == 2
{txt}(0 observations deleted)
r; t=0.00 21:44:57

{com}. drop _merge
{txt}r; t=0.00 21:44:57

{com}. 
. replace fah_annual = 0 if fah_annual == .
{txt}(0 real changes made)
r; t=0.00 21:44:57

{com}. gen food_aggregate_annual = food_at_home_annual + fah_annual
{txt}r; t=0.00 21:44:57

{com}. label var food_aggregate_annual "Final Nominal Annual Food Consumption"
{txt}r; t=0.00 21:44:57

{com}. 
. save "$data_tmp/agg_food_final.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/1_data/4_tmp/agg_food_final.dta{rm}
saved
{p_end}
r; t=0.03 21:44:57

{com}. 
. summarize food_aggregate_annual, detail

            {txt}Final Nominal Annual Food Consumption
{hline 61}
      Percentiles      Smallest
 1%    {res} 40964.75       12148.99
{txt} 5%    {res} 64650.55       12263.83
{txt}10%    {res} 83572.37       15447.32       {txt}Obs         {res}      9,600
{txt}25%    {res} 124604.1       17902.27       {txt}Sum of wgt. {res}      9,600

{txt}50%    {res}   186062                      {txt}Mean          {res} 217677.1
                        {txt}Largest       Std. dev.     {res} 146118.4
{txt}75%    {res} 270279.1        1677743
{txt}90%    {res} 382698.4        1681831       {txt}Variance      {res} 2.14e+10
{txt}95%    {res} 474771.5        1872537       {txt}Skewness      {res} 2.988249
{txt}99%    {res} 734834.3        2189697       {txt}Kurtosis      {res} 21.80604
{txt}r; t=0.01 21:44:57

{com}. 
{txt}end of do-file
r; t=29.81 21:44:57

{com}. do "$prep/5_final-agg.do"
{txt}
{com}. *------------------------------------------------------------------------------*
. * STEP 4: FINAL AGGREGATION (MASTER MERGE)                                     *
. *------------------------------------------------------------------------------*
. 
. * 1. START WITH FOOD AGGREGATE
. use "$data_tmp/agg_food_final.dta", clear
{txt}(NLSS04_DICT)
r; t=0.00 21:44:57

{com}. 
. * 2. MERGE NON-FOOD (NON-DURABLE)
. merge 1:1 psu_number hh_number using "$data_tmp/agg_nonfood_nondurable_final.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 21:44:57

{com}. drop if _merge == 2 // Should not happen, but safety check
{txt}(0 observations deleted)
r; t=0.00 21:44:57

{com}. drop _merge
{txt}r; t=0.00 21:44:57

{com}. replace agg_nonfood_nondurable = 0 if agg_nonfood_nondurable == .
{txt}(0 real changes made)
r; t=0.00 21:44:57

{com}. 
. * 3. MERGE HOUSING (RENT + UTILITIES)
. merge 1:1 psu_number hh_number using "$data_tmp/agg_housing_final.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 21:44:57

{com}. drop if _merge == 2
{txt}(0 observations deleted)
r; t=0.00 21:44:57

{com}. drop _merge
{txt}r; t=0.00 21:44:57

{com}. replace housing_aggregate_annual = 0 if housing_aggregate_annual == .
{txt}(0 real changes made)
r; t=0.00 21:44:57

{com}. 
. * 4. MERGE DURABLES FLOW
. merge 1:1 psu_number hh_number using "$data_tmp/agg_durables_final.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             224
{txt}{col 9}from master{col 30}{res}             224{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           9,376{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.03 21:44:57

{com}. drop if _merge == 2
{txt}(0 observations deleted)
r; t=0.00 21:44:57

{com}. drop _merge
{txt}r; t=0.00 21:44:57

{com}. replace durables_flow_annual = 0 if durables_flow_annual == .
{txt}(224 real changes made)
r; t=0.00 21:44:57

{com}. 
. * 5. MERGE POVERTY LINE & HH SIZE (FROM OFFICIAL FILE)
. * We need hhsize to calculate Per Capita, and the official weights.
. merge 1:1 psu_number hh_number using "$data_raw/poverty.dta", keepusing(hhsize hhs_wt pline domain ad_4 paasche)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.14 21:44:57

{com}. keep if _merge == 3
{txt}(0 observations deleted)
r; t=0.00 21:44:57

{com}. drop _merge
{txt}r; t=0.00 21:44:57

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 5: CALCULATE TOTAL CONSUMPTION (NOMINAL)                                *
. *------------------------------------------------------------------------------*
. 
. * Total Nominal Household Consumption
. gen total_consumption_nominal = food_aggregate_annual + ///
>                                 agg_nonfood_nondurable + ///
>                                 housing_aggregate_annual + ///
>                                 durables_flow_annual
{txt}r; t=0.00 21:44:57

{com}. 
. label var total_consumption_nominal "Total Annual Nominal HH Consumption"
{txt}r; t=0.00 21:44:57

{com}. 
. *------------------------------------------------------------------------------*
. * STEP 6: CALCULATE PER CAPITA CONSUMPTION (PCEP)                              *
. *------------------------------------------------------------------------------*
. 
. * Nominal Per Capita Consumption (NPR per person per year)
. gen pcep_nominal = total_consumption_nominal / hhsize
{txt}r; t=0.00 21:44:57

{com}. label var pcep_nominal "Per Capita Nominal Consumption"
{txt}r; t=0.00 21:44:57

{com}. 
. 
. 
. * Save Final Analytical File
. save "$data_tmp/final_consumption_aggregate.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/1_data/4_tmp/final_consumption_aggregate.dta{rm}
saved
{p_end}
r; t=0.02 21:44:57

{com}. 
{txt}end of do-file
r; t=0.22 21:44:57

{com}. 
. *------------------------------------------------------------------------------*                
. **#                                                     End of do file
. *------------------------------------------------------------------------------*
.         exit

{txt}end of do-file

r; t=0.00 21:44:57

{com}. exit, clear
