{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/4_log/01_data_merge_11Feb26_19.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Feb 2026, 19:37:25
{txt}r; t=0.00 19:37:25
{com}.         
. {c )-}       
{txt}r; t=0.02 19:37:25

{com}. *------------------------------------------------------------------------------*
. **#Load the dataset
. use "$data_raw/S08.dta", clear
{txt}(NLSS04_DICT)
r; t=0.01 19:37:25

{com}. 
. 
. foreach var in q08_06_i q08_14_i {c -(}
{txt}  2{com}.     replace `var' = 0 if `var' == .
{txt}  3{com}. {c )-}
{txt}(40,470 real changes made)
(39,424 real changes made)
r; t=0.01 19:37:25

{com}. 
. * Calculate Total Health Cost for this Person (Chronic + Acute)
. gen health_cost_person = q08_06_i + q08_14_i
{txt}r; t=0.00 19:37:25

{com}. 
. 
. **#1- Idea one is about distress financing.
. *Want to see how the household financed their health cost
. 
. local distress_codes "2 3"
{txt}r; t=0.00 19:37:25

{com}. 
. gen distress_chronic = 0
{txt}r; t=0.00 19:37:25

{com}. foreach c of local distress_codes {c -(}
{txt}  2{com}.     replace distress_chronic = 1 if q08_07 == `c'
{txt}  3{com}. {c )-}
{txt}(80 real changes made)
(871 real changes made)
r; t=0.01 19:37:25

{com}. 
. gen distress_acute = 0
{txt}r; t=0.00 19:37:25

{com}. foreach c of local distress_codes {c -(}
{txt}  2{com}.     replace distress_acute = 1 if q08_15 == `c'
{txt}  3{com}. {c )-}
{txt}(40 real changes made)
(223 real changes made)
r; t=0.01 19:37:25

{com}. 
. gen distress_person = (distress_chronic == 1 | distress_acute == 1)
{txt}r; t=0.00 19:37:25

{com}. 
. * Collapse to Household Level
. collapse (sum) health_exp_hh = health_cost_person /// Sum of all costs
>          (max) distress_hh = distress_person /// If ANY member used distress finance, HH is 1
>          , by(psu_number hh_number)
{res}{txt}r; t=0.05 19:37:25

{com}. 
. * Label them nicely
. label var health_exp_hh "Total Annual Household Health Expenditure (Nominal)"
{txt}r; t=0.00 19:37:25

{com}. label var distress_hh "Did HH use distress financing (Loans/Assets) for health?"
{txt}r; t=0.00 19:37:25

{com}. 
. merge 1:1 psu_number hh_number using "$data_tmp/final_nominal_consumption.dta", keepusing(total_nom_cons)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 19:37:25

{com}. drop _merge
{txt}r; t=0.00 19:37:25

{com}. merge 1:1 psu_number hh_number using "$data_raw/poverty.dta", keepusing (psu_number hh_number prov ad_4 prov domain ad_4 poor pcep quintile_pcep hhs_wt ind_wt hhsize pcep_food pcep_nonfood pcep)
{res}{txt}(label {bf:{txt}ad_4lab} already defined)
(label {bf:{txt}prov_lab} already defined)
(label {bf:{txt}domainlab} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,600{txt}  (_merge==3)
{col 5}{hline 41}
r; t=0.01 19:37:25

{com}. drop _merge
{txt}r; t=0.00 19:37:25

{com}. 
. replace health_exp_hh = 0 if health_exp_hh == .
{txt}(0 real changes made)
r; t=0.00 19:37:25

{com}. replace distress_hh = 0 if distress_hh == .
{txt}(0 real changes made)
r; t=0.00 19:37:25

{com}. 
. * Calculating the indicators
. 
. 
. gen health_share_real = (health_exp_hh / pcep) * 100
{txt}r; t=0.00 19:37:25

{com}. gen health_share_nf   = (health_exp_hh/ pcep_nonfood) * 100
{txt}r; t=0.00 19:37:25

{com}. 
. *Catastrophic Expenditure (Threshold = 10% of Total Budget)
. gen che_10 = (health_share_real > 10)
{txt}r; t=0.00 19:37:25

{com}. gen che_15 = (health_share_real > 15)
{txt}r; t=0.00 19:37:25

{com}. gen che_25 = (health_share_real > 25)
{txt}r; t=0.00 19:37:25

{com}. gen che_40 = (health_share_nf   > 40)
{txt}r; t=0.00 19:37:25

{com}. 
. ** Analysis Part
. 
. gen pop_wt = hhs_wt * hhsize
{txt}r; t=0.00 19:37:25

{com}. 
. 
. * 2.i. Percent of Households in "Catastrophe" (>10% spending)
. table quintile [iw=pop_wt], stat(mean che_10) nformat(%9.3f) 
{res}
{smcl}
{reset}{...}
{hline 20}{c -}{c TT}{c -}{c -}{hline 5}
{space 20} {c |}  {space 1}Mean
{hline 20}{c -}{c +}{c -}{c -}{hline 5}
Expenditure quintile {c |}  {space 5}
  1 (poorest){space 7} {c |}  {result:0.362}
  2{space 17} {c |}  {result:0.364}
  3{space 17} {c |}  {result:0.312}
  4{space 17} {c |}  {result:0.314}
  5 (richest){space 7} {c |}  {result:0.260}
  Total{space 13} {c |}  {result:0.322}
{hline 20}{c -}{c BT}{c -}{c -}{hline 5}
r; t=0.05 19:37:25

{com}. * 2.ii. Percent of Households in "Catastrophe" (>15% spending)
. table quintile [iw=pop_wt], stat(mean che_15) nformat(%9.3f) 
{res}
{smcl}
{reset}{...}
{hline 20}{c -}{c TT}{c -}{c -}{hline 5}
{space 20} {c |}  {space 1}Mean
{hline 20}{c -}{c +}{c -}{c -}{hline 5}
Expenditure quintile {c |}  {space 5}
  1 (poorest){space 7} {c |}  {result:0.296}
  2{space 17} {c |}  {result:0.292}
  3{space 17} {c |}  {result:0.250}
  4{space 17} {c |}  {result:0.240}
  5 (richest){space 7} {c |}  {result:0.205}
  Total{space 13} {c |}  {result:0.257}
{hline 20}{c -}{c BT}{c -}{c -}{hline 5}
r; t=0.05 19:37:25

{com}. * 2.iii. Percent of Households in "Catastrophe" (>25% spending)
. table quintile [iw=pop_wt], stat(mean che_25) nformat(%9.3f) 
{res}
{smcl}
{reset}{...}
{hline 20}{c -}{c TT}{c -}{c -}{hline 5}
{space 20} {c |}  {space 1}Mean
{hline 20}{c -}{c +}{c -}{c -}{hline 5}
Expenditure quintile {c |}  {space 5}
  1 (poorest){space 7} {c |}  {result:0.219}
  2{space 17} {c |}  {result:0.196}
  3{space 17} {c |}  {result:0.181}
  4{space 17} {c |}  {result:0.160}
  5 (richest){space 7} {c |}  {result:0.129}
  Total{space 13} {c |}  {result:0.177}
{hline 20}{c -}{c BT}{c -}{c -}{hline 5}
r; t=0.05 19:37:25

{com}. * 2.iv. Percent of Households in "Catastrophe" (>40% non-food spending)
. table quintile [iw=pop_wt], stat(mean che_40) nformat(%9.3f) 
{res}
{smcl}
{reset}{...}
{hline 20}{c -}{c TT}{c -}{c -}{hline 5}
{space 20} {c |}  {space 1}Mean
{hline 20}{c -}{c +}{c -}{c -}{hline 5}
Expenditure quintile {c |}  {space 5}
  1 (poorest){space 7} {c |}  {result:0.278}
  2{space 17} {c |}  {result:0.247}
  3{space 17} {c |}  {result:0.218}
  4{space 17} {c |}  {result:0.195}
  5 (richest){space 7} {c |}  {result:0.143}
  Total{space 13} {c |}  {result:0.216}
{hline 20}{c -}{c BT}{c -}{c -}{hline 5}
r; t=0.05 19:37:25

{com}. // (Multiply result by 100 to get percentage)
. 
. * 3. Percent of Households utilizing Distress Financing
. table quintile [iw=pop_wt], stat(mean distress_hh) nformat(%9.3f)
{res}
{smcl}
{reset}{...}
{hline 20}{c -}{c TT}{c -}{c -}{hline 5}
{space 20} {c |}  {space 1}Mean
{hline 20}{c -}{c +}{c -}{c -}{hline 5}
Expenditure quintile {c |}  {space 5}
  1 (poorest){space 7} {c |}  {result:0.155}
  2{space 17} {c |}  {result:0.115}
  3{space 17} {c |}  {result:0.091}
  4{space 17} {c |}  {result:0.068}
  5 (richest){space 7} {c |}  {result:0.055}
  Total{space 13} {c |}  {result:0.097}
{hline 20}{c -}{c BT}{c -}{c -}{hline 5}
r; t=0.08 19:37:26

{com}. 
. 
. * Label the dataset so you know what it is later
. label data "NLSS-IV Household Financial Protection Indicators (CHE & Distress)"
{txt}r; t=0.00 19:37:26

{com}. 
. * Save it to your temporary or processed data folder
. save "$data_tmp/health_financial_protection_hh.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Arpan Acharya/OneDrive - HERD/Documents/Personal/CIH-project/1_data/4_tmp/health_financial_protection_hh.dta{rm}
saved
{p_end}
r; t=0.00 19:37:26

{com}. 
. ee
{err}command {bf}ee{sf} is unrecognized
{txt}{search r(199), local:r(199);} t=0.00 19:37:26

end of do-file

{search r(199), local:r(199);} t=0.42 19:37:26

{com}. su che_10

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}che_10 {c |}{res}      9,600    .2932292    .4552663          0          1
{txt}r; t=0.00 19:37:29

{com}. su che_15

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}che_15 {c |}{res}      9,600    .2294792    .4205198          0          1
{txt}r; t=0.00 19:38:33

{com}. su che_25

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}che_25 {c |}{res}      9,600    .1557292    .3626173          0          1
{txt}r; t=0.00 19:38:40

{com}. su che_40

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}che_40 {c |}{res}      9,600    .1944792    .3958198          0          1
{txt}r; t=0.00 19:38:44

{com}. do "C:\Users\ARPANA~1\AppData\Local\Temp\STD36fc_000000.tmp"
{txt}
{com}. *------------------------------------------------------------------------------*
. *            Cleaning for Health Expenses related stuffs in NLSS                                           *
. /*
> 
>         Author:                         Arpan 
>         Date created:           10th Feb 2026
>         Date updated:           10th Feb 2026
>         Last Updated by:        Arpan
> 
>         Notes:                          
>                         
>         Dependencies:           Run 0_master before
> 
> */
. 
. 
. {c -(}
. *------------------------------------------------------------------------------*
. **#                                                     STATA setups                                                                        
. *------------------------------------------------------------------------------*
. clear
{txt}r; t=0.01 21:21:57
{com}. cap clear frames
{txt}r; t=0.00 21:21:57
{com}. set more off
{txt}r; t=0.00 21:21:57
{com}. set rmsg on
{txt}r; t=0.00 21:21:57
{com}. local dofilename "01_data_merge"
{txt}r; t=0.00 21:21:57
{com}. cap log close
{smcl}
{com}{sf}{ul off}